""" Functions that extract information given specific strings """
import re
from functools import cache
from typing import Optional

from skoufas_dbf_reader.utilities import none_if_empty_or_stripped, read_yaml_data

""" A regular expression for reading dewey numbers """
dewey_re = re.compile(r"([0-9\.]+)\s*([^0-9\.]*)")


def has_author(a01: Optional[str]) -> bool:
    """Check values for marks of missing author"""
    if not a01:
        return False
    if a01 in no_author_values():
        return False
    return True


@cache
def no_author_values() -> list[str]:
    """List of values implying there's no author"""
    return read_yaml_data("no_author")


@cache
def language_codes() -> dict[str, str]:
    """Map of language codes in A01 to ISO language codes"""
    return read_yaml_data("language_codes")


@cache
def dewey_corrections() -> dict[str, str]:
    """Map of invalid dewey codes found and manual overrides"""
    return read_yaml_data("invalid_dewey")


@cache
def field06_corrections() -> dict[str, Optional[str | dict[str, str | bool]]]:
    """Map of invalid entry numbers found and manual overrides"""
    return read_yaml_data("field06_corrections")


@cache
def translator_corrections() -> dict[str, str]:
    """Map of translator names found and manual overrides"""
    return read_yaml_data("translator_corrections")


def has_language(a01: Optional[str]) -> bool:
    """Check values for language at the end"""
    if not a01:
        return False
    for code in language_codes().keys():
        if a01.endswith(f" {code}"):
            return True
    return False


def author_part_from_a01(a01: Optional[str]) -> Optional[str]:
    """Get author from A01 DBF record"""
    if not a01:
        return None
    if not has_author(a01):
        return None
    strip_finals = list(language_codes().keys()) + [
        " Ι",
        " .",
    ]
    for final in strip_finals:
        if a01.endswith(" " + final):
            a01 = a01.replace(final, "")
    return a01.strip()


def language_from_a01(a01: Optional[str]) -> Optional[str]:
    """Check values for language at the end"""
    if not a01:
        return None
    if has_language(a01):
        for language, isolanguage in language_codes().items():
            if a01.endswith(language):
                return isolanguage
    return None


def title_from_a02(a02: Optional[str]) -> Optional[str]:
    """Cleanup"""
    return none_if_empty_or_stripped(a02)


def subtitle_from_a03(a03: Optional[str]) -> Optional[str]:
    """Cleanup"""
    return none_if_empty_or_stripped(a03)


def dewey_from_a04(a04: Optional[str]) -> Optional[str]:
    """Cleanup and replace known issues"""
    value = none_if_empty_or_stripped(a04)
    if not value:
        return None
    value = none_if_empty_or_stripped(dewey_corrections().get(value, value))
    if not value:
        return None

    value = value.replace("Χ. Σ.", "ΧΣ")
    value = value.replace("Χ. Σ", "ΧΣ")

    value = value.replace("X.S.", "ΧΣ")
    value = value.replace("Χ.Σ.", "ΧΣ")

    value = value.replace("Χ.Σ", "ΧΣ")
    value = value.replace("X.S", "ΧΣ")
    value = value.replace("X.Σ", "ΧΣ")
    value = value.replace("Σ.Σ", "ΧΣ")

    value = value.replace("Χ.Χ.", "ΧΧ")
    value = value.replace("Χ.Χ", "ΧΧ")

    dewey_match = dewey_re.fullmatch(value)
    if dewey_match:
        return f"{dewey_match[1]} {dewey_match[2]}".strip()
    return None


def entry_numbers_from_a05_a06(a05: Optional[str], a06: Optional[str]) -> list[str]:
    """Cleanup, read additional numbers from a06"""
    value5 = none_if_empty_or_stripped(a05)
    if not value5:
        value5 = ""
    value6 = none_if_empty_or_stripped(a06)
    if value6:
        if value6 in field06_corrections():
            correction = field06_corrections()[value6]
            if correction is None:
                value6 = ""
            elif isinstance(correction, str):
                value6 = "-" + str(correction)
            else:
                value6 = dict(correction).get("series", "")
                if not isinstance(value6, str):
                    raise Exception(f"Invalid correction for field A06 [{a06}]")
                if correction.get("use_dash", True):
                    value6 = "-" + value6
        else:
            value6 = ""
    else:
        value6 = ""
    value = value5 + value6
    entries = [v.strip() for v in value.split("-") if v.strip()]
    return entries


def translator_from_a06(a06: Optional[str]) -> Optional[str]:
    """Cleanup, replace special cases"""
    value = none_if_empty_or_stripped(a06)
    if not value:
        return None
    if value in field06_corrections():
        correction = field06_corrections()[value]
        if correction is None:
            return None
        elif isinstance(correction, str):
            return None
        else:
            value = dict(correction).get("translator", None)
            if not value:
                return None
            if not isinstance(value, str):
                raise Exception(f"Invalid correction for field A06 [{a06}]")
    value = translator_corrections().get(value, value)
    if not value:
        return None
    return value


# from collections import OrderedDict
# import os


# def edition_from_a07(a07: Optional[str]) -> Optional[str]:
#     """Cleanup
#     >>> edition_from_a07(None) # None
#     >>> edition_from_a07('') # None
#     >>> edition_from_a07(' ') # None
#     >>> edition_from_a07('6ΕΚΔ')
#     '6ΕΚΔ'
#     """
#     if not a07:
#         return None
#     if not a07.strip():
#         return None
#     return a07.strip()


# def editor_from_a01_a08(A1, A8):
#     """Cleanup
#     >>> editor_from_a01_a08(None, None) # None
#     >>> editor_from_a01_a08(None, '') # None
#     >>> editor_from_a01_a08(None, ' ') # None
#     >>> editor_from_a01_a08('woo', 'Χ.Ε') # None
#     >>> editor_from_a01_a08('hello', 'X.S') # None
#     >>> editor_from_a01_a08('author', '6ΕΚΔ')
#     '6ΕΚΔ'
#     """
#     if not A8:
#         return None
#     if A8 in [
#         "Χ.Ε",
#         "X.S",
#     ]:
#         return None
#     if not A8.strip():
#         return None
#     return A8.strip()


# date_in_edition_place_re = re.compile(r"\d+")

# place_replacement_map = {
#     " ΑΘΗΑΝ": "ΑΘΗΝΑ",
#     "ATHEN": "ΑΘΗΝΑ",
#     "ATHENES": "ΑΘΗΝΑ",
#     "ATHENS": "ΑΘΗΝΑ",
#     "AUHNA": "ΑΘΗΝΑ",
#     "AΘΗΝΑ": "ΑΘΗΝΑ",
#     "AMSTERDAN": "AMSTERDAM",
#     "ANSTERDAM": "AMSTERDAM",
#     "LEIPTZ": "LEIPZIG",
#     "LEIPTZIG": "LEIPZIG",
#     "LEIPZIK": "LEIPZIG",
#     "LEIPZIQ": "LEIPZIG",
#     "LEIRZIG": "LEIPZIG",
#     "LEPZIG": "LEIPZIG",
# }


# def edition_place_from_a09_a10(A9, A10):
#     """Cleanup
#     >>> edition_place_from_a09_a10(None, None) # None
#     >>> edition_place_from_a09_a10(None, '') # None
#     >>> edition_place_from_a09_a10(None, ' ') # None
#     >>> edition_place_from_a09_a10('woo', '')
#     'woo'
#     >>> edition_place_from_a09_a10('2010', 'woo') # None
#     >>> edition_place_from_a09_a10('LEPZIG', 'woo')
#     'LEIPZIG'
#     """
#     if not A9:
#         return None
#     if A9 in place_replacement_map:
#         return place_replacement_map[A9]
#     A9 = A9.strip()
#     if not A9:
#         return None
#     if date_in_edition_place_re.fullmatch(A9):
#         return None
#     return A9


# invalid_dates = [
#     "142Σ",
#     "193",
#     "62Σ",
#     "9180",
#     "9331",
#     "2099",
#     "383Σ",
#     "5775",
#     "X.E",
#     "Α950",
#     "Α964",
#     "Α982",
#     "Α985",
#     "Α989",
#     "ΑΡΤΑ",
#     "ΑΩΕ",
#     "Ι964",
#     "ΩΝ",
#     "X.X",
#     "Χ.Τ",
#     "Χ.Ε",
#     "Χ.Χ",
# ]
# valid_edition_date_re = re.compile(r"\d{4}|MCMX|MCML")


# def edition_date_from_a10(A10):
#     """Cleanup
#     >>> edition_date_from_a10(None) # None
#     >>> edition_date_from_a10('') # None
#     >>> edition_date_from_a10(' ') # None
#     >>> edition_date_from_a10('Χ.Τ') # None
#     >>> edition_date_from_a10('ΑΡΤΑ') # None
#     >>> edition_date_from_a10('Α989') # None
#     >>> edition_date_from_a10('MCMX')
#     'MCMX'
#     >>> edition_date_from_a10('2010')
#     '2010'
#     >>> edition_date_from_a10('197Ο')
#     '1970'
#     >>> edition_date_from_a10('foobar')
#     Traceback (most recent call last):
#       ...
#     Exception: invalid date [foobar]
#     """
#     if not A10:
#         return None
#     A10 = A10.strip()
#     if not A10:
#         return None
#     if A10 in invalid_dates:
#         return None
#     if A10 == "197Ο":  # bah...
#         return "1970"
#     if not valid_edition_date_re.fullmatch(A10):
#         raise Exception(f"invalid date [{A10}]")
#     return A10


# valid_pages_re = re.compile(r"(\d+)\s*(Σ|S|ΣΕΛ|Δ|Σ Ρ|ΣΑ|ΣΙΣ|Σ Ε|ΣΕΓ|Σ18|ΣΚΑ|ΣΑΜ|Σ Ο|s|Σ Λ|Σ  Α|Σ Ι|σ|Φ)*")
# known_page_replacements = {
#     "29ΙΣ": 291,
#     "183Σ11": 183,
#     "'": None,
#     "Χ.Χ": None,
#     "ΑΘΗΝΑ": None,
#     "ΕΛΛΗΝΙ": None,
#     "507Σ#Ξ": 507,
#     "ΧΧΙΙΙ": 23,
#     "123-40": None,
#     "129-75": None,
#     "145-92": None,
#     "146-14": None,
#     "204-47": None,
#     "311-28": None,
#     "31-9": None,
#     "362-75": None,
#     "37-50Σ": None,
#     "415-31": None,
#     "425-30": None,
#     "484-96": None,
#     "495-99": None,
#     "555-73": None,
#     "616-45": None,
#     "884-56": None,
#     "90-119": None,
#     "9-39": None,
#     "133CAN": None,
# }


# def pages_from_a11(A11):
#     """Cleanup
#     >>> pages_from_a11(None) # None
#     >>> pages_from_a11('') # None
#     >>> pages_from_a11(' ') # None
#     >>> pages_from_a11('foobar')
#     Traceback (most recent call last):
#       ...
#     Exception: invalid pages [foobar]
#     >>> pages_from_a11('127Σ')
#     127
#     >>> pages_from_a11('447Σ Ε')
#     447
#     >>> pages_from_a11('256ΣΕΓ')
#     256
#     >>> pages_from_a11('29ΙΣ')
#     291
#     """

#     if not A11:
#         return None
#     A11 = A11.strip()
#     if not A11:
#         return None
#     if A11 in known_page_replacements:
#         return known_page_replacements[A11]
#     m = valid_pages_re.fullmatch(A11)
#     if not m:
#         raise Exception(f"invalid pages [{A11}]")
#     return int(m.group(1))


# topic_in_paren_re = re.compile(r".*?\((.*)\).*")

# topic_replacements = {
#     ".. ΣΤΟΝ ΓΙΑΝΝΗ ΡΙΤΣΟ": "ΡΙΤΣΟΣ",  # 1 .. STON GIANNI RITSO
#     ".. ΣΤΟΝ ΤΑΣΟ ΛΕΙΒΑΔΙΤΗ": "ΛΕΙΒΑΔΙΤΗΣ",  # 1 .. STON TASO LEIVADITI
#     "'": "",
#     "\\": "",
#     "\\ΠΟΛΙΤΙΚΗ": "ΠΟΛΙΤΙΚΗ",  # 1 \POLITIKI
#     "$ΕΝΟΓΛΩΣΣΟ": "ΞΕΝΟΓΛΩΣΣΟ",  # 1
#     "1550Π.Χ": "1550 Π.Χ",  # 1 1550P.CH
#     "19 ΑΙΩΝΑ": "19 ΑΙΩΝΑΣ",  # 1
#     "272-167Μ.Χ": "272-167 Μ.Χ",  # 1 272-167M.CH
#     "28 ΟΚΤΩΒΡΙΟΥ 1940": "28 ΟΚΤΩΒΡΙΟΥ 1940",  # 1
#     "28 ΟΚΤΩΜΒΡΙΟΥ": "28 ΟΚΤΩΒΡΙΟΥ 1940",  # 3
#     "2ο ΠΑΓΚΟΣΜΙΟ ΠΟΛΕΜΟ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "2ΟΣ ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "395Μ.Χ": "395 Μ.Χ",  # 1 395M.CH
#     "427Π.Χ": "427 Π.Χ",  # 1 427P.CH
#     "800.203ΑΚΤ": "",
#     "867Μ.Χ": "867 Μ.Χ",
#     "AMEIKANIKH ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "AMERIKANIKH ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "AMEΡIKANIKH ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "AMEΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 2
#     "BEST SELLER": "BEST SELLER",  # 29
#     "BEST SLLER": "BEST SELLER",  # 1
#     "BOYLGARIA": "ΒΟΥΛΓΑΡΙΑ",  # 1
#     "EL GRECO": "ΕΛ ΓΚΡΕΚΟ",
#     "IΣΤΟΡΙΚΟ": "ΙΣΤΟΡΙΚΟ",  # 1 ISTORIKO
#     "KINEZIKH ΛΟΓΟΤΕΧΝΙΑ": "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 5
#     "KINEZIΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "NΟΡΒΗΓΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΝΟΡΒΗΓΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 NORVIGIKI LOGOTECHNIA
#     "SHOCK": "ΣΟΚ",  # 1 SHOCK
#     "TOYRKIA": "ΤΟΥΡΚΙΑ",  # 1 TOYRKIA
#     "TΕΧΝH": "ΤΕΧΝΗ",  # 1 TECHNH
#     "Α ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Α ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",
#     "Α'ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Α ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",
#     "Α'ΠΑΓΚΟΣΜΙΟΣ": "Α ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",
#     "Α": "",
#     "ΑΓΓΚΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΝΧΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΚΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΓΛΟΣΑΞΩΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΙΟΙ": "ΑΓΙΟΙ",
#     "ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ ΚΟΜΠΟΤΙΟΥ": "ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ ΚΟΜΠΟΤΙΟΥ",
#     "ΑΓΙΟΣ ΓΕΩΡΓΙΟΥ ΚΟΜΠΟΤΙΟΥ": "ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ ΚΟΜΠΟΤΙΟΥ",
#     "ΑΓΙΟΥΣ ΤΟΠΟΥΣ": "ΑΓΙΟΙ ΤΟΠΟΙ",
#     "ΑΓΙΟΥΣ": "ΑΓΙΟΙ",
#     "ΑΓΚΥΚΛΟΠΑΙΔΕΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΑΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΤΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΑΓΩΝΑΣ ΑΝΕΞΑΡΤΗΣΙΑΣ": "ΑΓΩΝΕΣ ΑΝΕΞΑΡΤΗΣΙΑΣ",  # 2 AGONAS ANEXARTISIAS
#     "ΑΓΩΝΑΣ": "ΑΓΩΝΕΣ",  # 2 AGONAS
#     "ΑΓΩΝΙΣΤΕΣ": "ΑΓΩΝΙΣΤΕΣ",
#     "ΑΓΩΝΙΣΤΗΣ": "ΑΓΩΝΙΣΤΕΣ",
#     "ΑΘΗΝΑ.ΕΘΝΙΚΟ ΑΡΧ/ΚΟ ΜΟΥΣΕΙΟ": "ΑΘΗΝΑ ΕΘΝΙΚΟ ΑΡΧΑΙΟΛΟΓΙΚΟ ΜΟΥΣΕΙΟ",
#     "ΑΘΗΝΑΓΟΡΑΣ Α'": "ΑΘΗΝΑΓΟΡΑΣ",
#     "ΑΘΗΝΑΓΟΡΑΣ Α": "ΑΘΗΝΑΓΟΡΑΣ",
#     "ΑΘΗΝΑΙΟΙ": "ΑΘΗΝΑΙΟΙ",
#     "ΑΘΗΝΑΙΟΣ": "ΑΘΗΝΑΙΟΙ",
#     "ΑΘΗΝΑΙΟΥ": "ΑΘΗΝΑΙΟΙ",
#     "ΑΘΗΝΑΟΙ": "ΑΘΗΝΑΙΟΙ",
#     "ΑΘΝΙΚΗ ΑΝΤΙΣΤΑΣΗ": "ΕΘΝΙΚΗ ΑΝΤΙΣΤΑΣΗ",
#     "ΑΙΣΘΗΤΗΚΗ": "ΑΙΣΘΗΤΙΚΗ",
#     "ΑΙΣΘΗΤΙΚΑ ΔΟΚΙΜΙΑ": "ΑΙΣΘΗΤΙΚΑ ΔΟΚΙΜΙΑ",
#     "ΑΙΣΘΗΤΙΚΑ": "ΑΙΣΘΗΤΙΚΗ",
#     "ΑΙΣΘΗΤΙΚΗ": "ΑΙΣΘΗΤΙΚΗ",
#     "ΑΙΣΘΗΤΙΚΟ ΔΟΚΙΜΙΟ": "ΑΙΣΘΗΤΙΚΑ ΔΟΚΙΜΙΑ",
#     "ΑΙΣΤΟΡΙΑ": "ΙΣΤΟΡΙΑ",  # 1 AISTORIA
#     "ΑΙΤ/ΝΙΑ": "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑ",
#     "ΑΙΤΩΛΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ": "ΑΙΤΩΛΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ",
#     "ΑΙΤΩΛΙΚΗ ΣΥΜΠΟΛΙΤΙΑ": "ΑΙΤΩΛΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ",
#     "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙ": "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑ",
#     "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑ": "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑ",
#     "ΑΙΤΩΛΟΚΑΡΝΑΝΙΑ": "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑ",
#     "ΑΙΧΜΑΛΩΤΟΙ": "ΑΙΧΜΑΛΩΤΟΙ",
#     "ΑΙΧΜΑΛΩΤΟΣ": "ΑΙΧΜΑΛΩΤΟΙ",
#     "ΑΛΕΞΑΜΔΡΟΣ": "ΑΛΕΞΑΝΔΡΟΣ",
#     "ΑΛΕΞΑΝΔΡΟΣ": "ΑΛΕΞΑΝΔΡΟΣ",
#     "ΑΛΗ ΠΑΣΑ": "ΑΛΗ ΠΑΣΑΣ",
#     "ΑΛΗ ΠΑΣΑΣ": "ΑΛΗ ΠΑΣΑΣ",
#     "ΑΛΦΑΒΗΤΑΡΙΟ": "ΑΛΦΑΒΗΤΑΡΙΟ",
#     "ΑΛΦΑΒΗΤΑΡΙΟΝ": "ΑΛΦΑΒΗΤΑΡΙΟ",
#     "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΚΩΣΤΑΝΤΙΝΟΥΠΟΛΕΩΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΚΩΣΤΑΝΤΙΝΟΥΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΤΗΣ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΕΩΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΤΗΣ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΤΗΣ ΚΩΣΤΑΝΤΙΝΟΥΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΛΩΣΗ ΤΗΣ ΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",
#     "ΑΜΑΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 3
#     "ΑΜΕΙΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΗ  ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΔΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 4
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 185
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΠΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΗΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΕΡΙΚΑΝΙΚΟ ΝΟΥΑΡ11": "ΑΜΕΡΙΚΑΝΙΚΟ ΝΟΥΑΡ",
#     "ΑΜΕΡΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1
#     "ΑΜΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΜΕΡΙΚΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 2
#     "ΑΜΣΤΕΡΝΤΑΜ.ΚΡΑΤΙΚΟ ΜΟΥΣΕΙΟ": "ΑΜΣΤΕΡΝΤΑΜ ΚΡΑΤΙΚΟ ΜΟΥΣΕΙΟ",
#     "ΑΜΣΤΕΡΝΤΑΜ.ΜΟΥΣΕΙΟ ΒΑΝ ΓΚΟΓΚ": "ΑΜΣΤΕΡΝΤΑΜ ΜΟΥΣΕΙΟ ΒΑΝ ΓΚΟΓΚ",
#     "ΑΝΑΓΝΩΣΤΙΚΑ": "ΑΝΑΓΝΩΣΤΙΚΟ",
#     "ΑΝΑΞΑΡΤΗΣΙΑ": "ΑΝΕΞΑΡΤΗΣΙΑ",
#     "ΑΝΑΠΤΥΞΙΑΚΟ ΠΡΟΓΡΑΜΜΑ": "ΑΝΑΠΤΥΞΙΑΚΟ ΠΡΟΓΡΑΜΜΑ",
#     "ΑΝΑΠΥΞΙΑΚΟ ΠΡΟΓΡΑΜΜΑ": "ΑΝΑΠΤΥΞΙΑΚΟ ΠΡΟΓΡΑΜΜΑ",
#     "ΑΝΘΟΛΟΓΙΑ ΑΡΤΙΝΩΝ ΣΥΓΓΡΑΦΕΩΝ": "ΑΝΘΟΛΟΓΙΑ ΑΡΤΙΝΩΝ ΣΥΓΓΡΑΦΕΩΝ",
#     "ΑΝΘΟΛΟΓΙΑ ΑΡΤΙΝΩΝ ΣΥΓΓΡΦΑΕΩΝ": "ΑΝΘΟΛΟΓΙΑ ΑΡΤΙΝΩΝ ΣΥΓΓΡΑΦΕΩΝ",
#     "ΑΝΘΟΛΟΓΙΑ ΛΟΓΟΤΕΧΝΙΑ": "ΑΝΘΟΛΟΓΙΑ ΛΟΓΟΤΕΧΝΙΑΣ",
#     "ΑΝΘΟΛΟΓΙΑ ΛΟΓΟΤΕΧΝΙΑΣ": "ΑΝΘΟΛΟΓΙΑ ΛΟΓΟΤΕΧΝΙΑΣ",
#     "ΑΝΘΟΛΟΓΙΑ ΠΟΙΗΜΑΤΟΣ": "ΑΝΘΟΛΟΓΙΑ ΠΟΙΗΜΑΤΩΝ",
#     "ΑΝΘΟΛΟΓΙΑ ΠΟΙΗΜΑΤΩΝ": "ΑΝΘΟΛΟΓΙΑ ΠΟΙΗΜΑΤΩΝ",
#     "ΑΝΘΡΩΠΟ": "ΑΝΘΡΩΠΟΣ",
#     "ΑΝΘΡΩΠΟΙ": "ΑΝΘΡΩΠΟΣ",
#     "ΑΝΘΡΩΠΟΣ": "ΑΝΘΡΩΠΟΣ",
#     "ΑΞΟΝΑΣ ΤΗΣ ΟΙΝΟΜΙΑΣ": "ΑΞΟΝΑΣ ΤΗΣ ΟΙΚΟΝΟΜΙΑΣ",
#     "ΑΠΕΡΓΙΑ": "ΑΠΕΡΓΙΑ",
#     "ΑΠΕΡΓΙΕΣ": "ΑΠΕΡΓΙΑ",
#     "ΑΠΟΘΕΜΑΤ": "ΑΠΟΘΕΜΑΤΑ",
#     "ΑΠΟΘΕΜΑΤΑ": "ΑΠΟΘΕΜΑΤΑ",
#     "ΑΠΟΚΗΡΑΜΕΝΕΣ ΤΡΟΦΕΣ": "ΑΠΟΞΗΡΑΜΕΝΕΣ ΤΡΟΦΕΣ",
#     "ΑΠΟΚΡΙΦΙΜΣΟΣ": "ΑΠΟΚΡΥΦΙΣΜΟΣ",
#     "ΑΠΟΚΡΙΦΙΣΜΟΣ": "ΑΠΟΚΡΥΦΙΣΜΟΣ",
#     "ΑΠΟΜΝΗΜΟΝΕΥΜΑΤΑ": "ΑΠΟΜΝΗΜΟΝΕΥΜΑΤΑ",
#     "ΑΠΟΜΝΗΜΟΝΕΥΝΑΤΑ": "ΑΠΟΜΝΗΜΟΝΕΥΜΑΤΑ",
#     "ΑΠΟΜΝΗΜΟΝΥΜΑΤΑ": "ΑΠΟΜΝΗΜΟΝΕΥΜΑΤΑ",
#     "ΑΠΟΞΗΡΑΜΕΝΕΣ ΤΡΟΦΕΣ": "ΑΠΟΞΗΡΑΜΕΝΕΣ ΤΡΟΦΕΣ",
#     "ΑΡΗ ΒΕΛΟΥΧΙΩΤΗ": "ΑΡΗΣ ΒΕΛΟΥΧΙΩΤΗΣ",
#     "ΑΡΗΣ ΒΕΛΟΥΧΙΩΤΗΣ": "ΑΡΗΣ ΒΕΛΟΥΧΙΩΤΗΣ",
#     "ΑΡΘΡΟΥ": "ΑΡΘΡΑ",
#     "ΑΡΙΘΜΗΤΙΚΗ": "ΑΡΙΘΜΗΤΙΚΗ",
#     "ΑΡΙΘΜΗΤΙΚΗΣ": "ΑΡΙΘΜΗΤΙΚΗ",
#     "ΑΡΙΣΤΟΤΕΛΗ": "ΑΡΙΣΤΟΤΕΛΗΣ",
#     "ΑΡΙΣΤΟΤΕΛΗΣ": "ΑΡΙΣΤΟΤΕΛΗΣ",
#     "ΑΡΙΣΤΟΦΑΝΗ": "ΑΡΙΣΤΟΦΑΝΗΣ",
#     "ΑΡΙΣΤΟΦΑΝΗΣ": "ΑΡΙΣΤΟΦΑΝΗΣ",
#     "ΑΡΧΑΙΑ  ΕΛΛΑΔΑ": "ΑΡΧΑΙΑ ΕΛΛΑΔΑ",
#     "ΑΡΧΑΙΑ ΕΛΛΑΔΑ": "ΑΡΧΑΙΑ ΕΛΛΑΔΑ",
#     "ΑΡΧΑΙΑ ΕΛΛΔΑ": "ΑΡΧΑΙΑ ΕΛΛΑΔΑ",
#     "ΑΡΧΑΙΑ ΤΡΑΓΩΔΙΑ ΚΩΜΩΔΙΑ": "ΑΡΧΑΙΑ ΚΩΜΩΔΙΑ ΤΡΑΓΩΔΙΑ",  # 1 ARCHAIA TRAGODIA KOMODIA
#     "ΑΡΧΑΙΑΟΤΗΤΑ": "ΑΡΧΑΙΟΤΗΤΑ",
#     "ΑΡΧΑΙΛΟΓΙΚΑ": "ΑΡΧΑΙΟΛΟΓΙΚΑ",
#     "ΑΡΧΑΙΟΙ ΣΓΓΡΑΦΕΙΣ": "ΑΡΧΑΙΟΙ ΣΥΓΓΡΑΦΕΙΣ",
#     "ΑΡΧΑΙΟΛΟΓΙΑΣ": "ΑΡΧΑΙΟΛΟΓΙΑ",
#     "ΑΡΧΑΙΟΛΟΓΙΚΟΣ": "ΑΡΧΑΙΟΛΟΓΙΚΑ",
#     "ΑΡΧΑΙΟΤΗΤΑ": "ΑΡΧΑΙΟΤΗΤΑ",
#     "ΑΡΧΑΙΟΤΗΤΕΣ": "ΑΡΧΑΙΟΤΗΤΑ",
#     "ΑΡΧΑΟΤΗΤΑ": "ΑΡΧΑΙΟΤΗΤΑ",
#     "ΑΡΧΕΙΑ ΤΡΑΓΩΔΙΑ": "ΑΡΧΑΙΑ ΤΡΑΓΩΔΙΑ",
#     "ΑΡΧΕΙΟ": "ΑΡΧΕΙΟ",
#     "ΑΡΧΕΙΟΝ ΠΟΝΤΟΥ": "ΑΡΧΕΙΟ ΠΟΝΤΟΥ",
#     "ΑΡΧΕΙΟΝ": "ΑΡΧΕΙΟ",
#     "ΑΡΧΙΑΟ": "",
#     "ΑΡΧΙΜΑΝΤΡΙΤΗΣ": "ΑΡΧΙΜΑΝΔΡΙΤΗΣ",
#     "ΑΡΧΙΜΑΝΤΡΙΤΟΥ": "ΑΡΧΙΜΑΝΔΡΙΤΗΣ",
#     "ΑΣΚΗΣΕΙΣ ΓΥΜΝΑΣΤΙΚΗ": "ΑΣΚΗΣΕΙΣ ΓΥΜΝΑΣΤΙΚΗΣ",
#     "ΑΣΤΥΝΟΜΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ": "ΑΣΤΥΝΟΜΙΚΟ",
#     "ΑΣΤΥΝΟΜΙΚΟ ΜΥΘΙΣΤΟΤΗΜΑ": "ΑΣΤΥΝΟΜΙΚΟ",
#     "ΑΣΤΥΝΟΜΙΚΟ ΜΥΘΙΤΟΡΗΜΑ": "ΑΣΤΥΝΟΜΙΚΟ",
#     "ΑΤΡΙΚΗ": "ΙΑΤΡΙΚΗ",
#     "ΑΤΤΙΚΟΣ 0 ΗΡΩΔΗΣ": "ΗΡΩΔΗΣ ΑΤΤΙΚΟΣ",
#     "ΑΥΣΤΡΙΚΑ": "ΑΥΣΤΡΙΑΚΑ",
#     "ΑΥΤΟΒΙΟΓΡΑΦΙΑ": "ΑΥΤΟΒΙΟΓΡΑΦΙΑ",
#     "ΑΥΤΟΒΙΟΓΡΑΦΙΕΣ": "ΑΥΤΟΒΙΟΓΡΑΦΙΑ",
#     "ΑΥΤΟΒΟΓΡΑΦΙΑ": "ΑΥΤΟΒΙΟΓΡΑΦΙΑ",
#     "ΑΦΗΓΗΜΑ": "ΑΦΗΓΗΜΑ",
#     "ΑΦΗΓΗΜΑΤΑ": "ΑΦΗΓΗΜΑ",
#     "ΑΦΗΓΗΣΕΙΣ": "ΑΦΗΓΗΣΕΙΣ",
#     "ΑΦΗΓΜΑΤΑ": "ΑΦΗΓΗΜΑ",
#     "ΑΦΗΣΗΣΕΙΣ": "ΑΦΗΓΗΣΕΙΣ",
#     "ΑΧΑΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ": "ΑΧΑΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ",
#     "ΑΧΑΙΚΗ ΣΥΜΠΟΛΙΤΙΑ": "ΑΧΑΙΚΗ ΣΥΜΠΟΛΙΤΕΙΑ",
#     "Β ΠΑΓΚΟΣΜΙΟ ΠΟΛΕΜΟ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 9
#     "Β ΠΑΓΚΟΣΜΙΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "Β ΠΣΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "Β.ΑΜΕΡΙΚΗ": "ΒΟΡΕΙΟΣ ΑΜΕΡΙΚΗ",  # 2 V.AMERIKI
#     "Β.ΑΦΡΙΚΗ": "ΒΟΡΕΙΟΣ ΑΦΡΙΚΗ",  # 1 V.AFRIKI
#     "Β.ΗΠΕΙΡΟΣ": "ΒΟΡΕΙΑ ΗΠΕΙΡΟΣ",  # 6 V.IPEIROS
#     "Β' ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 1
#     "Β'ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 4
#     "Β'ΠΑΓΚΟΣΜΙΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",  # 4
#     "ΒΑΛΕΡΙΟ ΜΑΞΙΜΟ": "ΒΑΛΕΡΙΟΣ ΜΑΞΙΜΟΣ",  # 1 VALERIO MAXIMO
#     "ΒΑΡΝΑΛΗΣ,ΚΩΣΤΑΣ": "ΚΩΣΤΑΣ ΒΑΡΝΑΛΗΣ",  # 1 VARNALIS,KOSTAS
#     "ΒΑΣΙΛΕΙΑΣ ΓΕΩΡΓΙΟΣ Α'": "ΒΑΣΙΛΕΙΑΣ ΓΕΩΡΓΙΟΣ Α",  # 1 VASILEIAS GEORGIOS A'
#     "ΒΕΝΕΤΙΑ.ΠΙΝΑΚ/ΚΗ ΤΗΣ ΑΚΑΔ": "ΒΕΝΕΤΙΑ ΠΙΝΑΚΟΘΗΚΗ ΤΗΣ ΑΚΑΔΗΜΙΑΣ",  # 1 VENETIA.PINAK/KI TIS AKAD
#     "ΒΕΝΕΤΙΑ.ΠΙΝΑΚ/ΚΗ ΤΗΣ ΑΚΑΔΗΜΙΑΣ": "ΒΕΝΕΤΙΑ ΠΙΝΑΚΟΘΗΚΗ ΤΗΣ ΑΚΑΔΗΜΙΑΣ",  # 1 VENETIA.PINAK/KI TIS AKADIMIAS
#     "ΒΕΡΟΛΙΝΟ.ΠΙΝΑΚΟΘΗΚΗ": "ΒΕΡΟΛΙΝΟ ΠΙΝΑΚΟΘΗΚΗ",  # 1 VEROLINO.PINAKOTHIKI
#     "ΒΙΓΟΡΑΦΙΚΟ ΣΧΕΔΙΑΣΜΑ": "ΒΙΟΓΡΑΦΙΚΟ ΣΧΕΔΙΑΣΜΑ",  # 1 VIGORAFIKO SCHEDIASMA
#     "ΒΙΕΝΝΗ.ΜΟΥΣΕΙΟ ΙΣΤΟΡΙΑΣ ΤΗΣ ΤΕΧΝΗΣ": "ΒΙΕΝΝΗ ΜΟΥΣΕΙΟ ΙΣΤΟΡΙΑΣ ΤΗΣ ΤΕΧΝΗΣ",  # 1 VIENNI.MOUSEIO ISTORIAS TIS TECHNIS
#     "ΒΙΚΤΩΡ ΟΥΓΚΟ": "ΒΙΚΤΟΡ ΟΥΓΚΟ",  # 1 VIKTOR OUGKO
#     "ΒΙΚΤΩΡ ΟΥΓΚΩ": "ΒΙΚΤΟΡ ΟΥΓΚΟ",  # 1 VIKTOR OUGKO
#     "ΒΙΟΓΡΑΔΦΙΑ": "ΒΙΟΓΡΑΦΙΑ",  # 1 VIOGRADFIA
#     "ΒΙΟΜΗΧ.ΕΚΜΕΤΑΛ.ΚΑΥΣΙΜΩΝ": "ΒΙΟΜΗΧΑΝΙΚΗ ΕΚΜΕΤΑΛΛΕΥΣΗ ΚΑΥΣΙΜΩΝ",  # 1 VIOMICH.EKMETAL.KAFSIMON
#     "ΒΟΡ.ΗΠΕΙΡΟΥ": "ΒΟΡΕΙΑ ΗΠΕΙΡΟΣ",  # 1 VOR.IPEIROU
#     "ΒΟΡΕΙΟ ΗΠΕΙΡΟΣ": "ΒΟΡΕΙΑ ΗΠΕΙΡΟΣ",  # 4 VOREIO IPEIROS
#     "ΒΟΡΕΙΟΣ ΗΠΕΙΡΟΣ": "ΒΟΡΕΙΑ ΗΠΕΙΡΟΣ",  # 11 VOREIOS IPEIROS
#     "ΒΟΥΛΓΑΡΙΚΗ ΛΟΓΟΤΕΝΧΙΑ": "ΒΟΥΛΓΑΡΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 VOULGARIKI LOGOTENCHIA
#     "ΒΡΑΧΑΝΙΣΜΟΣ": "ΒΡΑΧΜΑΝΙΣΜΟΣ",  # 1 VRACHANISMOS
#     "ΒΥΖΑΝΤΙΝΗ ΑΥΤΟΚΡΤΑΟΡΙΑ": "ΒΥΖΑΝΤΙΝΗ ΑΥΤΟΚΡΑΤΟΡΙΑ",  # 1 VYZANTINI AFTOKRTAORIA
#     "ΒΥΖΑΝΤΙΝΗ ΑΥΤΟΡΑΤΟΡΙΑ": "ΒΥΖΑΝΤΙΝΗ ΑΥΤΟΚΡΑΤΟΡΙΑ",  # 1 VYZANTINI AFTORATORIA
#     "ΒΥΖΑΝΤΙΟΥ": "ΒΥΖΑΝΤΙΟ",  # 2 VYZANTIOU
#     "ΒΥΖΝΑΤΙΟ": "ΒΥΖΑΝΤΙΟ",  # 1 VYZNATIO
#     "ΒΥΝΑΝΤΙΟ": "ΒΥΖΑΝΤΙΟ",  # 1 VYNANTIO
#     "ΒΥΝΤΑΝΤΙΟ": "ΒΥΖΑΝΤΙΟ",  # 1 VYNTANTIO
#     "ΓEΡMANIKO ΠAIΔIKO BIBΛIO": "ΓΕΡΜΑΝΙΚΟ ΠΑΙΔΙΚΟ ΒΙΒΛΙΟ",  # 1 GERMANIKO PAIDIKO BIBLIO
#     "ΓEΡMANIKO": "ΓΕΡΜΑΝΙΚΑ",  # 1 GERMANIKO
#     "ΓΑΛΛΙΚΗ ;ΠΓΟΤΕΧΝΙΑ": "ΓΑΛΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 GALLIKI ;PGOTECHNIA
#     "ΓΑΛΛΙΚΟ ΥΠΟΠΡΟΞΕΝΕΙΟΥ": "ΓΑΛΛΙΚΟ ΥΠΟΠΡΟΞΕΝΕΙΟ",  # 1 GALLIKO YPOPROXENEIOU
#     "ΓΑΡΟΥΦΑΛΙΑΣ Ε": "ΓΑΡΟΥΦΑΛΙΑΣ ΕΥΑΓΓΕΛΟΣ",  # 1 GAROUFALIAS E
#     "ΓΕΓΡΑΦΙΑ": "ΓΕΩΓΡΑΦΙΑ",  # 2 GEGRAFIA
#     "ΓΕΛΕΙΟΓΡΑΦΙΑ": "ΓΕΛΟΙΟΓΡΑΦΙΕΣ",  # 1 GELEIOGRAFIA
#     "ΓΕΜΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΓΕΡΜΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 GEMANIKI LOGOTECHNIA
#     "ΓΕΝΕΟΛΟΓΙΑ": "ΓΕΝΕΑΛΟΓΙΑ",  # 1 GENEOLOGIA
#     "ΓΕΝΟΚΤΟΝΙΑ ΠΟΛΤΙΩΝ": "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΙΩΝ",  # 1 GENOKTONIA POLTION
#     "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΙΑΚΟΥ ΕΛΛΗΝΙΣΜΟΥ": "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΙΩΝ",  # 1 GENOKTONIA PONTIAKOU ELLINISMOU
#     "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΟΣ": "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΙΩΝ",  # 1 GENOKTONIA PONTOS
#     "ΓΕΝΟΚΤΟΝΙΑ ΤΟΥ ΠΟΝΤΟΥ": "ΓΕΝΟΚΤΟΝΙΑ ΠΟΝΤΙΩΝ",  # 1 GENOKTONIA TOU PONTOU
#     "ΓΕΡΜΑΝΙKΑ": "ΓΕΡΜΑΝΙΚΑ",  # 1 GERMANIKA
#     "ΓΕΡΜΑΝΙΚΗ  ΛΟΓΟΤΕΧΝΙΑ": "ΓΕΡΜΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 GERMANIKI  LOGOTECHNIA
#     "ΓΕΡΜΑΝΙΚΗ": "ΓΕΡΜΑΝΙΚΑ",  # 1 GERMANIKI
#     "ΓΕΡΜΑΝΙΚΟ": "ΓΕΡΜΑΝΙΚΑ",  # 3 GERMANIKO
#     "ΓΕΡΜΑΝΟ": "ΓΕΡΜΑΝΙΚΑ",  # 1 GERMANO
#     "ΓΕΦΥΡΙ ΤΗΣ ΑΡΤΑΣ": "ΓΕΦΥΡΙ ΑΡΤΑΣ",  # 1 GEFYRI TIS ARTAS
#     "ΓΕΦΥΡΙ": "ΓΕΦΥΡΙΑ",  # 1 GEFYRI
#     "ΓΕΩΓΙΑ": "ΓΕΩΡΓΙΑ",  # 1 GEOGIA
#     "ΓΕΩΡΓΑΦΙΑ": "ΓΕΩΓΡΑΦΙΑ",  # 1 GEORGAFIA
#     "ΓΕΩΡΓΙΟΣ Α'": "ΓΕΩΡΓΙΟΣ Α",  # 3 GEORGIOS A'
#     "ΓΕΩΡΓΙΟΣ Β'": "ΓΕΩΡΓΙΟΣ Β",  # 1 GEORGIOS V'
#     "ΓΕΩΡΓΟΣ": "ΓΕΩΡΓΟΙ",  # 1 GEORGOS
#     "ΓΙΑΝΝΙΝΑ": "ΓΙΑΝΝΕΝΑ",  # 2 GIANNINA
#     "ΓΙΑΤΡΟΣ": "ΓΙΑΤΡΟΙ",  # 1 GIATROS
#     "ΓΙΟΓΚΟΣΛΑΒΙΑ": "ΓΙΟΥΓΚΟΣΛΑΒΙΑ",  # 4 GIOGKOSLAVIA
#     "ΓΛΩΣΣΑ ΕΛΛΗΝΙΚΗ": "ΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ",  # 1 GLOSSA ELLINIKI
#     "ΓΛΩΣΣΑΡΙΟ": "ΓΛΩΣΣΑΡΙ",  # 1 GLOSSARIO
#     "ΓΛΩΣΣΙΚΟ ΙΔΙΩΜΑ": "ΓΛΩΣΣΙΚΑ ΙΔΙΩΜΑΤΑ",  # 1 GLOSSIKO IDIOMA
#     "ΓΛΩΣΣΟΛΟΓΙΚΑ": "ΓΛΩΣΣΟΛΟΓΙΑ",  # 1 GLOSSOLOGIKA
#     "ΓΥΝΑΙΚΑ": "ΓΥΝΑΙΚΕΣ",  # 6 GYNAIKA    "Η/Υ": "ΗΛΕΚΤΡΟΝΙΚΟΙ ΥΠΟΛΟΓΙΣΤΕΣ",  # 1 I/Y
#     "ΓΩΓΟΣ ΜΠΑΚΟΛΑ": "ΓΩΓΟΣ ΜΠΑΚΟΛΑΣ",  # 1 GOGOS BAKOLA
#     "Δ,ΣΤΕΡΕΑ ΕΛΛΑΔΑ": "ΔΥΤΙΚΗ ΣΤΕΡΕΑ ΕΛΛΑΔΑ",
#     "Δ.ΕΥΡΩΠΗ": "ΔΥΤΙΚΗ ΕΥΡΩΠΗ",
#     "ΔΑΝΤΗ": "ΔΑΝΤΗΣ",
#     "ΔΑΝΤΗΣ": "ΔΑΝΤΗΣ",
#     "ΔΕΜΤΡΑ": "ΔΕΝΤΡΑ",
#     "ΔΕΣΠΟΤΑΤΟ ΤΗΣ ΗΠΕΙΡΟΣ": "ΔΕΣΠΟΤΑΤΟ ΤΗΣ ΗΠΕΙΡΟΥ",
#     "ΔΕΥΤΕΡΟΣ ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ": "Β ΠΑΓΚΟΣΜΙΟΣ ΠΟΛΕΜΟΣ",
#     "ΔΗΜΗΚΡΑΤΙΑ": "ΔΗΜΟΚΡΑΤΙΑ",
#     "ΔΗΜΙΟΥΡΓΕΙΑ": "ΔΗΜΙΟΥΡΓΙΑ",
#     "ΔΗΜΙΟΥΡΓΙΑ": "ΔΗΜΙΟΥΡΓΙΑ",
#     "ΔΗΜΟΣΙΕ ΣΧΕΣΕΙΣ": "ΔΗΜΟΣΙΕΣ ΣΧΕΣΕΙΣ",
#     "ΔΗΜΟΣΙΕΣ ΣΧΕΣΕΙΣ": "ΔΗΜΟΣΙΕΣ ΣΧΕΣΕΙΣ",
#     "ΔΗΜΟΣΙΕΣ ΣΧΕΣΙΕΣ": "ΔΗΜΟΣΙΕΣ ΣΧΕΣΕΙΣ",
#     "ΔΗΜΟΣΙΟ ΔΙΑΚΙΟ": "ΔΗΜΟΣΙΟ ΔΙΚΑΙΟ",
#     "ΔΗΜΟΣΙΟΓΡΑΦΟΙ": "ΔΗΜΟΣΙΟΓΡΑΦΟΙ",
#     "ΔΗΜΟΣΙΟΓΡΑΦΟΣ": "ΔΗΜΟΣΙΟΓΡΑΦΟΙ",
#     "ΔΗΜΟΤΙΚΟΥ ΤΡΑΓΟΥΔΙ": "ΔΗΜΟΤΙΚΟ ΤΡΑΓΟΥΔΙ",
#     "ΔΙΑΓΓΡΑΜΜΑ": "ΔΙΑΓΡΑΜΜΑ",
#     "ΔΙΑΚΥΒΕΡΝΗΤ ΔΙΑΣΚΕΨΗ": "ΔΙΑΚΥΒΕΡΝΗΤΙΚΗ ΔΙΑΣΚΕΨΗ",
#     "ΔΙΑΛΕΞΕΙΣ": "ΔΙΑΛΕΞΕΙΣ",
#     "ΔΙΑΛΕΞΗ": "ΔΙΑΛΕΞΕΙΣ",
#     "ΔΙΑΝΟΥΜΕΝΟΙ": "ΔΙΑΝΟΟΥΜΕΝΟΙ",
#     "ΔΙΑΤΡΙΒΕΣ": "ΔΙΑΤΡΙΒΕΣ",
#     "ΔΙΑΤΡΙΒΗ": "ΔΙΑΤΡΙΒΕΣ",
#     "ΔΙΑΦΟΡΑ                                Δ": "ΔΙΑΦΟΡΑ",
#     "ΔΙΑΦΩΤΙΣΜΟ": "ΔΙΑΦΩΤΙΣΜΟΣ",
#     "ΔΙΔΑΣΚΑΛΕΙΑ": "ΔΙΔΑΣΚΑΛΙΑ",
#     "ΔΙΔΑΣΚΑΛΙΑ": "ΔΙΔΑΣΚΑΛΙΑ",
#     "ΔΙΕΘΝΕΣ ΔΙΑΚΙΟ": "ΔΙΕΘΝΕΣ ΔΙΚΑΙΟ",
#     "ΔΙΕΘΝΕΣ ΟΙΚΟΝΟΜΙΑ": "ΔΙΕΘΝΗΣ ΟΙΚΟΝΟΜΙΑ",
#     "ΔΙΕΘΝΗ ΟΙΚΟΝΟΜΙΑ": "ΔΙΕΘΝΗΣ ΟΙΚΟΝΟΜΙΑ",
#     "ΔΙΗΓΗΜΑ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑ",  # 2 DIIGIMA ELLINIKI LOGOTECHNIA
#     "ΔΙΗΓΗΜΑ,ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑ",  # 1 DIIGIMA,ELLINIKI LOGOTECHNIA
#     "ΔΙΗΓΗΜΑΑ": "ΔΙΗΓΗΜΑ",
#     "ΔΙΗΓΗΜΑΤ": "ΔΙΗΓΗΜΑ",
#     "ΔΙΗΓΗΜΑΤΑ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑ",  # 2 DIIGIMATA ELLINIKI LOGOTECHNIA
#     "ΔΙΗΓΗΜΑΤΑ": "ΔΙΗΓΗΜΑ",
#     "ΔΙΗΓΗΜΑΤΟΣ": "ΔΙΗΓΗΜΑ",
#     "ΔΙΗΓΗΜΤΑΤΑ": "ΔΙΗΓΗΜΑ",
#     "ΔΙΗΓΗΣΕΙΣ": "ΔΙΗΓΗΣΕΙΣ",
#     "ΔΙΗΓΗΣΗ": "ΔΙΗΓΗΣΕΙΣ",
#     "ΔΙΚΑΙΩΜΑΤΑ ΑΝΘΡΩΠΟΥ": "ΔΙΚΑΙΩΜΑΤΑ ΑΝΘΡΩΠΟΥ",
#     "ΔΙΚΑΙΩΜΑΤΑ ΑΝΘΡΩΠΩΝ": "ΔΙΚΑΙΩΜΑΤΑ ΑΝΘΡΩΠΟΥ",
#     "ΔΙΚΑΙΩΜΑΤΑ ΤΟΥ ΑΝΘΡΩΠΟΥ": "ΔΙΚΑΙΩΜΑΤΑ ΑΝΘΡΩΠΟΥ",
#     "ΔΙΚΑΤΟΡΕΣ": "ΔΙΚΤΑΤΟΡΕΣ",
#     "ΔΙΚΗ ΝΥΡΕΜΒΕΡΓΗ": "ΔΙΚΗ ΝΥΡΕΜΒΕΡΓΗΣ",
#     "ΔΙΟΙΚΗΤΙΚΗ ΕΠΕΤΗΡΙΔΑ": "ΔΙΟΙΚΗΤΙΚΗ ΕΠΕΤΗΡΙΔΑ",
#     "ΔΙΟΙΚΗΤΙΚΗ ΕΠΕΤΗΡΙΣ": "ΔΙΟΙΚΗΤΙΚΗ ΕΠΕΤΗΡΙΔΑ",
#     "ΔΙΣΚΟΣ ΤΗΣ ΦΑΙΣΤΟΥ": "ΔΙΣΚΟΣ ΦΑΙΣΤΟΥ",
#     "ΔΙΣΚΟΣ ΦΑΙΣΤΟΥ": "ΔΙΣΚΟΣ ΦΑΙΣΤΟΥ",
#     "ΔΙΣΡΑΤΟ": "ΔΙΣΤΡΑΤΟ",
#     "ΔΙΣΤΡΑΤΟ": "ΔΙΣΤΡΑΤΟ",
#     "ΔΟΚΙΜΑ": "ΔΟΚΙΜΙΑ",
#     "ΔΟΚΙΜΙΑ ΕΛΛΗΝΙΚΗ": "ΔΟΚΙΜΙΑ ΕΛΛΗΝΙΚΑ",
#     "ΔΟΚΙΜΙΟ ΕΛΛΗΝΙΚΟ": "ΔΟΚΙΜΙΑ ΕΛΛΗΝΙΚΑ",
#     "ΔΟΜΟΣΙΟΓΡΑΦΙΚΗ ΔΕΟΝΤΟΛΟΓΙΑ": "ΔΗΜΟΣΙΟΓΡΑΦΙΚΗ ΔΕΟΝΤΟΛΟΓΙΑ",
#     "ΔΡΑΜΑΤΙΚΟ ΠΟΙΗΜΑ": "ΔΡΑΜΑΤΙΚΗ ΠΟΙΗΣΗ",  # 1 DRAMATIKO POIIMA
#     "ΔΡΑΣΕΙΣ ΓΙΑ ΤΗΝ ΠΡΟΣΤΑΣΙΑ ΤΟΥ ΠΕΡΙΒΑΛΛΟ": "ΔΡΑΣΕΙΣ ΓΙΑ ΤΗΝ ΠΡΟΣΤΑΣΙΑ ΤΟΥ ΠΕΡΙΒΑΛΛΟΝΤΟΣ",
#     "ΔΥΝΑΣΤΕΙΑ": "ΔΥΝΑΣΤΕΙΕΣ",
#     "ΔΩΔΕΚΑΝΗΣΑ": "ΔΩΔΕΚΑΝΗΣΑ",
#     "ΔΩΔΕΚΑΣΗΣΑ": "ΔΩΔΕΚΑΝΗΣΑ",
#     "ΔΩΡΙΟΙΣ": "ΔΩΡΙΟΙ",
#     "ΕΓΚΛΗΜΑΤΙΚΟΤΗΣ": "ΕΓΚΛΗΜΑΤΙΚΟΤΗΤΑ",
#     "ΕΓΚΛΗΜΑΤΙΚΟΤΗΤΑ": "ΕΓΚΛΗΜΑΤΙΚΟΤΗΤΑ",
#     "ΕΓΚΥΚΚΟΠΑΙΔΕΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΕΓΚΥΚΛΟΑΠΙΔΕΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΕΓΚΥΚΛΟΠΑΙΔ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ ΑΡΧΑΙΑΣ ΕΛΛΗΝΙΚΗΣ ΙΣΤΟΡΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ ΑΡΧΑΙΑΣ ΕΛΛΗΝΙΚΗΣ ΙΣΤΟΡΙΑΣ",
#     "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΕΓΡΟ": "ΕΡΓΟ",
#     "ΕΓΥΚΛΟΠΑΙΔΕΙΑ": "ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",
#     "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΒΙΒΛΙΑ": "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΒΙΒΛΙΑ",
#     "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΕΡΓΑ": "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΕΡΓΑ",
#     "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΗ": "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΕΡΓΑ",
#     "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΟ ΒΙΒΛΙΟ": "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΒΙΒΛΙΑ",
#     "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΟ": "ΕΙΚΟΝΟΓΡΑΦΗΜΕΝΑ ΕΡΓΑ",
#     "ΕΙΚΟΝΟΜΑΧΙΑ": "ΕΙΚΟΝΟΜΑΧΙΑ",
#     "ΕΙΚΟΝΟΜΑΧΙΕΣ": "ΕΙΚΟΝΟΜΑΧΙΑ",
#     "ΕΚΑΠΙΔΕΥΣΗ": "ΕΚΠΑΙΔΕΥΣΗ",
#     "ΕΚΚΚΛΗΣΙΑΣΤΙΚΗ ΙΣΤΟΡΙΑ": "ΕΚΚΛΗΣΙΑΣΤΙΚΗ ΙΣΤΟΡΙΑ",
#     "ΕΚΚΛΗΙΣΑ": "ΕΚΚΛΗΣΙΑ",
#     "ΕΚΚΛΗΣΙΑ": "ΕΚΚΛΗΣΙΑ",
#     "ΕΚΚΛΗΣΙΑΖΟΥΣΑΙ": "ΕΚΚΛΗΣΙΑΖΟΥΣΕΣ",
#     "ΕΚΚΛΗΣΙΕΣ": "ΕΚΚΛΗΣΙΑ",
#     "ΕΚΚΛΗΣΙΣΤΙΚΑ ΓΕΓΟΝΟΤΑ": "ΕΚΚΛΗΣΙΑΣΤΙΚΑ ΓΕΓΟΝΟΤΑ",
#     "ΕΚΠΑΙΔΕΣΥΗ ΕΙΡΗΝΗΣ": "ΕΚΠΑΙΔΕΥΣΗ ΕΙΡΗΝΗΣ",
#     "ΕΚΤΡΩΣΕΙΣ": "ΕΚΤΡΩΣΕΙΣ",
#     "ΕΚΤΡΩΣΗ": "ΕΚΤΡΩΣΕΙΣ",
#     "ΕΛ ΕΛΑΜΕΙΝ": "ΕΛ ΑΛΑΜΕΙΝ",
#     "ΕΛΗΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΗΝΙΚΗ ΙΣΤΟΡΙΑ": "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ",  # 1 ELINIKI ISTORIA
#     "ΕΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 2 ELINIKI POIISI
#     "ΕΛΗΝΙΚΟ ΔΙΗΓΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑ",  # 1 ELINIKO DIIGIMA
#     "ΕΛΛΑΔΑ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ELLADA LOGOTECHNIA
#     "ΕΛΛΑΔΑΣ": "ΕΛΛΑΔΑ",  # 2 ELLADAS
#     "ΕΛΛΑΣΡΩΣΙΑ": "ΕΛΛΑΣ ΡΩΣΙΑ",  # 1 ELLASROSIA
#     "ΕΛΛΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΛΛΗΙΚΗ ΛΟΓΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 2 ELLIIKI POIISI
#     "ΕΛΛΗΝΕΣ ΦΙΛΟΣΟΣΦΟΙ": "ΕΛΛΗΝΕΣ ΦΙΛΟΣΟΦΟΙ",  # 1 ELLINES FILOSOSFOI
#     "ΕΛΛΗΝΙΑΛΒΑΝΙΚΗ ΕΝΩΣΗ": "ΕΛΛΗΝΟΑΛΒΑΝΙΚΗ ΕΝΩΣΗ",  # 1 ELLINIALVANIKI ENOSI
#     "ΕΛΛΗΝΙΕΣ ΦΟΡΕΣΙΕΣ": "ΕΛΛΗΝΙΚΕΣ ΦΟΡΕΣΙΕΣ",  # 1 ELLINIES FORESIES
#     "ΕΛΛΗΝΙΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 2 ELLINII POIISI
#     "ΕΛΛΗΝΙΚ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΑ ΔΙΗΓΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑ",  # 5 ELLINIKA DIIGIMATA
#     "ΕΛΛΗΝΙΚΑ ΔΟΚΙΜΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΟΚΙΜΙΑ",  # 28 ELLINIKA DOKIMIA
#     "ΕΛΛΗΝΙΚΑ ΕΛΕΥΘΕΡΙΑ": "ΕΛΛΗΝΙΚΗ ΕΛΕΥΘΕΡΙΑ",  # 1 ELLINIKA ELEFTHERIA
#     "ΕΛΛΗΝΙΚΑ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ",
#     "ΕΛΛΗΝΙΚΑ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΑ ΠΟΙΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 4 ELLINIKA POIIMATA
#     "ΕΛΛΗΝΙΚΑ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 2 ELLINIKA POIISI
#     "ΕΛΛΗΝΙΚΗ  ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΖΩΓΡΑΦΙΑ": "ΕΛΛΗΝΙΚΗ ΖΩΓΡΑΦΙΚΗ",  # 1 ELLINIKI ZOGRAFIA
#     "ΕΛΛΗΝΙΚΗ ΘΕΑΤΡΟ": "ΕΛΛΗΝΙΚΟ ΘΕΑΤΡΟ",  # 4 ELLINIKI THEATRO
#     "ΕΛΛΗΝΙΚΗ ΙΔΣΤΟΡΙΑ": "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ",  # 1 ELLINIKI IDSTORIA
#     "ΕΛΛΗΝΙΚΗ ΙΣΤ0ΡΙΑ": "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ",  # 1 ELLINIKI IST0RIA
#     "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ ΤΟΥ ΠΟΛΙΤΙΣΜΟΥ ΤΟΥ ΚΛΑΣΙΚΟΥ ΚΟΣΜΟ": "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ ΤΟΥ ΠΟΛΙΤΙΣΜΟΥ ΤΟΥ ΚΛΑΣΙΚΟΥ ΚΟΣΜΟΥ",  # 1 ELLINIKI ISTORIA TOU POLITISMOU TOU KLASIKOU KOSMO
#     "ΕΛΛΗΝΙΚΗ ΛΑΠΓΡΑΦΙΑ": "ΕΛΛΗΝΙΚΗ ΛΑΟΓΡΑΦΙΑ",  # 1 ELLINIKI LAPGRAFIA
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΙΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΕΤΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΔΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΝΧΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΕΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ                    Λ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ",  # 2 ELLINIKI LOGOTECHNIA DIIGIMAT
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΧΡΟΝΙΚΟ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΧΡΟΝΙΚΟ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ, ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ,ΔΙΗΓΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ,ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "εΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ0ΘΕΑΤΡΟ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΘΕΑΤΡΟ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑΔΙΗΓΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΔΙΗΓΗΜΑΤΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΨΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΓΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΗΓΟΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΗΠΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗ ΛΥΡΙΚΟΙ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΛΥΡΙΚΗ ΠΟΙΗΣΗ",  # 1 ELLINIKI LYRIKOI POIISI
#     "ΕΛΛΗΝΙΚΗ ΜΕΘΟΡΙΟ": "ΕΛΛΗΝΙΚΗ ΜΕΘΟΡΙΟΣ",  # 1 ELLINIKI METHORIO
#     "ΕΛΛΗΝΙΚΗ ΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΜΑ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 ELLINIKI POIIMA
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 3 ELLINIKI POIIMATA
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 2 ELLINIKI POIIS
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ,ΠΟΙΗΜΑΤΑ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 ELLINIKI POIISI,POIIMATA
#     "εΛΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 eLLINIKI POIISI
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1478 ELLINIKI POIISI
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗΣ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 6 ELLINIKI POIISIS
#     "ΕΛΛΗΝΙΚΗ ΠΟΙΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 ELLINIKI POISI
#     "ΕΛΛΗΝΙΚΗ ΠΟΟΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 ELLINIKI POOISI
#     "ΕΛΛΗΝΙΚΗ ΦΙΛΟΣΟΦΑΙ": "ΕΛΛΗΝΙΚΗ ΦΙΛΟΣΟΦΙΑ",  # 1 ELLINIKI FILOSOFAI
#     "ΕΛΛΗΝΙΚΗ ΦΙΟΛΣΟΦΙΑ": "ΕΛΛΗΝΙΚΗ ΦΙΛΟΣΟΦΙΑ",  # 1 ELLINIKI FIOLSOFIA
#     "ΕΛΛΗΝΙΚΗΓ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΗΙΣΤΟΡΙΑ": "ΕΛΛΗΝΙΚΗ ΙΣΤΟΡΙΑ",  # 2 ELLINIKIISTORIA
#     "ΕΛΛΗΝΙΚΗΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΙ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΟ ΚΙΝΗΜΑΤΟΓΡΑΦΟΣ": "ΕΛΛΗΝΙΚΟΣ ΚΙΝΗΜΑΤΟΓΡΑΦΟΣ",  # 1 ELLINIKO KINIMATOGRAFOS
#     "ΕΛΛΗΝΙΚΟ ΛΟΓΟΤΕΧΝΕΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΛΛΗΝΙΚΟ ΠΟΝΤΟ": "ΕΛΛΗΝΙΚΟΣ ΠΟΝΤΟΣ",  # 1 ELLINIKO PONTO
#     "ΕΛΛΗΝΙΚΟ ΣΤΡΑΤΟΣ": "ΕΛΛΗΝΙΚΟΣ ΣΤΡΑΤΟΣ",  # 1 ELLINIKO STRATOS
#     "ΕΛΛΗΝΙΚΟΥ ΠΟΛΙΤΙΣΜΟΥ": "ΕΛΛΗΝΙΚΟΣ ΠΟΛΙΤΙΣΜΟΣ",  # 1 ELLINIKOU POLITISMOU
#     "ΕΛΛΗΝΙΛΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΜΗ ΛΟΓΟΤΕΧΝΕΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",
#     "ΕΛΛΗΝΙΝΕΣ": "ΕΛΛΗΝΕΣ",  # 1 ELLININES
#     "ΕΛΛΗΝΙΝΟΒΟΥΛΓΑΡΙΚΟΣ ΠΟΛΕΜΟΣ": "ΕΛΛΗΝΟΒΟΥΛΓΑΡΙΚΟΣ ΠΟΛΕΜΟΣ",  # 1 ELLININOVOULGARIKOS POLEMOS
#     "ΕΛΛΗΝΙΣΤΙΚΗ ΕΠΟΧΗ": "ΕΛΛΗΝΙΣΤΙΚΗ ΕΠΟΧΗ",  # 2 ELLINISTIKI EPOCHI
#     "ΕΛΛΗΝΙΣΤΙΚΗ ΠΕΡΙΟΔΟΣ": "ΕΛΛΗΝΙΣΤΙΚΗ ΕΠΟΧΗ",  # 1 ELLINISTIKI PERIODOS
#     "ΕΛΛΗΝΙΣΤΙΚΗ ΧΡΟΝΟΙ": "ΕΛΛΗΝΙΣΤΙΚΗ ΕΠΟΧΗ",  # 1 ELLINISTIKI CHRONOI
#     "ΕΛΛΗΝΙΣΤΙΚΟΙ ΧΡΟΝΟΙ": "ΕΛΛΗΝΙΣΤΙΚΗ ΕΠΟΧΗ",  # 3 ELLINISTIKOI CHRONOI
#     "ΕΛΛΗΝΟ": "",  # 1 ELLINO
#     "ΕΛΛΗΝΟΑΜΕΡΙΚΕΣ ΣΧΕΣΕΙΣ": "ΕΛΛΗΝΟΑΜΕΡΙΚΑΝΙΚΕΣ ΣΧΕΣΕΙΣ",  # 1 ELLINOAMERIKES SCHESEIS
#     "ΕΛΛΗΝΟΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ELLINOKI LOGOTECHNIA ???
#     "ΕΛΛΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",
#     "ΕΞΕΛΙΞΗ ΕΛΛΗΝΙΚΗ ΕΜΠΟΡΙΚΗΣ ΝΑΥΤΙΛΙΑΣ": "ΕΞΕΛΙΞΗ ΕΛΛΗΝΙΚΗΣ ΕΜΠΟΡΙΚΗΣ ΝΑΥΤΙΛΙΑΣ",  # 1 EXELIXI ELLINIKI EMPORIKIS NAFTILIAS
#     "ΕΞΟΔΟΣ ΜΕΣΣΟΛΟΓΙΟΥ": "ΕΞΟΔΟΣ ΜΕΣΟΛΟΓΓΙΟΥ",  # 1 EXODOS MESSOLOGIOU
#     "ΕΞΟΜΟΛΟΓΗΤΙΚΗ": "ΕΞΟΜΟΛΟΓΗΣΗ",  # 1 EXOMOLOGITIKI
#     "ΕΞΟΠΛΙΣΤΙΚΟ ΠΡΟΓ": "ΕΞΟΠΛΙΣΤΙΚΟ ΠΡΟΓΡΑΜΜΑ",  # 1 EXOPLISTIKO PRONCH
#     "ΕΞΟΠΛΙΣΤΙΚΟ ΠΡΟΓΡ": "ΕΞΟΠΛΙΣΤΙΚΟ ΠΡΟΓΡΑΜΜΑ",  # 1 EXOPLISTIKO PROGR
#     "ΕΞΩΓΗΙΝΟΥΣ": "ΕΞΩΓΗΙΝΟΙ",  # 1 EXOGIINOUS
#     "ΕΠΑΝΑΣΤΑΣΕΙΣ 1866 ΚΑΙ 1878": "ΕΠΑΝΑΣΤΑΣΗ 1866 ΚΑΙ 1878",  # 1 EPANASTASEIS 1866 KAI 1878
#     "ΕΠΑΝΑΣΤΑΣΗ ΤΟΥ 1821": "ΕΠΑΝΑΣΤΑΣΗ 1821",  # 1 EPANASTASI TOU 1821
#     "ΕΠΑΣΤΑΣΗ": "ΕΠΑΝΑΣΤΑΣΗ",  # 1 EPASTASI
#     "ΕΠΕΙΣΟΔΙΟΝ ΜΟΥΣΟΥΡΟΥ": "ΕΠΕΙΣΟΔΙΟ ΜΟΥΣΟΥΡΟΥ",  # 1 EPEISODION MOUSOUROU
#     "ΕΠΕΤΗΡΙΔΑ ΕΤΟΥΣ 1969": "ΕΠΕΤΗΡΙΔΕΣ ΕΤΟΥΣ 1969",  # 1 EPETIRIDA ETOUS 1969
#     "ΕΠΕΤΗΡΙΔΑ": "ΕΠΕΤΗΡΙΔΕΣ",  # 7 EPETIRIDA
#     "ΕΠΕΤΗΡΙΣ": "ΕΠΕΤΗΡΙΔΕΣ",  # 2 EPETIRIS
#     "ΕΠΙΚΑΙΙΡΑ ΚΕΙΜΕΝΑ": "ΕΠΙΚΑΙΡΑ ΚΕΙΜΕΝΑ",  # 1 EPIKAIIRA KEIMENA
#     "ΕΠΙΣΤΗΜΕΣ": "ΕΠΙΣΤΗΜΗ",  # 2 EPISTIMES
#     "ΕΠΙΣΤΗΜΙΝΙΚΗ ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ": "ΕΠΙΣΤΗΜΟΝΙΚΗ ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",  # 1 EPISTIMINIKI EGKYKLOPAIDEIA
#     "ΕΠΙΣΤΗΜΟΝΙΚΗ ΕΓΚΥΚΛΟΑΠΙΔΕΙΑ": "ΕΠΙΣΤΗΜΟΝΙΚΗ ΕΓΚΥΚΛΟΠΑΙΔΕΙΑ",  # 1 EPISTIMONIKI EGKYKLOAPIDEIA
#     "ΕΠΙΣΤΟΛΗ": "ΕΠΙΣΤΟΛΕΣ",  # 2 EPISTOLI
#     "ΕΠΙΧΕΙΡΗΣΕΙΣ": "ΕΠΙΧΕΙΡΗΣΗ",  # 8 EPICHEIRISEIS
#     "ΕΡΓΑ ΤΟΥ": "",  # 1 ERGA TOU
#     "ΕΡΓΑΣΙΚΗ ΕΠΙΤΡΟΠΗ": "ΕΡΓΑΣΙΑΚΗ ΕΠΙΤΡΟΠΗ",  # 1 ERGASIKI EPITROPI
#     "ΕΡΓΑΤΙΚΟ ΑΓΩΝΑΣ": "ΕΡΓΑΤΙΚΟΣ ΑΓΩΝΑΣ",  # 1 ERGATIKO AGONAS
#     "ΕΣΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ESLLINIKI LOGOTECHNIA
#     "ΕΤΑΙΡΕΙΕΣ": "ΕΤΑΙΡΙΕΣ",  # 1 ETAIREIES
#     "ΕΤΑΙΡΕΙΣ": "ΕΤΑΙΡΙΕΣ",  # 1 ETAIREIS
#     "ΕΤΑΙΡΙΕΣ": "ΕΤΑΙΡΙΕΣ",  # 2 ETAIRIES
#     "ΕΥΓΕΝΙΟΣ ΑΙΤΩΛΟΣ": "ΕΥΓΕΝΙΟΣ Ο ΑΙΤΩΛΟΣ",  # 1 EVGENIOS AITOLOS
#     "ΕΥΘΥΜΟΓΡΑΦΗΜΑ": "ΕΥΘΥΜΟΓΡΑΦΗΜΑ",
#     "ΕΥΘΥΜΟΓΡΑΦΗΜΑΤΑ": "ΕΥΘΥΜΟΓΡΑΦΗΜΑ",
#     "ΕΦΗΜΕΡΙΔΑ": "ΕΦΗΜΕΡΙΔΕΣ",
#     "ΕΦΗΜΕΡΙΔΕΣ": "ΕΦΗΜΕΡΙΔΕΣ",
#     "ΖΑΚΥΝΘΟ": "ΖΑΚΥΝΘΟΣ",  # 2 ZAKYNTHO
#     "ΖΑΛΟΓΓΟΣ": "ΖΑΛΟΓΓΟ",  # 1 ZALONGOS
#     "ΖΑΧΑΡΙΑΔΗ": "ΖΑΧΑΡΙΑΔΗΣ",  # 1 ZACHARIADI
#     "Η ΑΛΩΣΗ ΤΗΣ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",  # 1 I ALOSI TIS KONSTANTINOUPOLIS
#     "Η ΑΛΩΣΗ ΤΗΣ ΠΟΛΗΣ": "ΑΛΩΣΗ ΚΩΝΣΤΑΝΤΙΝΟΥΠΟΛΗΣ",  # 3 I ALOSI TIS POLIS
#     "Η ΑΣΠΙΔΑ ΤΟΥ ΑΧΙΛΛΕΑ": "ΑΣΠΙΔΑ ΤΟΥ ΑΧΙΛΛΕΑ",  # 1 I ASPIDA TOU ACHILLEA
#     "Η Γ ΕΘΝΟΣΥΝΕΛΕΥΣΙΣ": "Γ ΕΘΝΟΣΥΝΕΛΕΥΣΙΣ",  # 1 I G ETHNOSYNELEFSIS
#     "Η ΓΕΝΙΑ ΤΟΥ '30": "ΓΕΝΙΑ ΤΟΥ 30",  # 1 I GENIA TOU '30
#     "Η ΕΛΛΗΝΙΚΗ ΟΙΚΟΝΟΜΙΑ": "ΕΛΛΗΝΙΚΗ ΟΙΚΟΝΟΜΙΑ",  # 1 I ELLINIKI OIKONOMIA
#     "Η ΖΩΗ": "ΖΩΗ",  # 1 I ZOI
#     "Η ΜΑΧΗ 1947": "ΜΑΧΗ 1947",  # 1 I MACHI 1947
#     "Η ΜΑΧΗ ΤΗΣ ΕΛΛΑΔΟΣ": "ΜΑΧΗ ΤΗΣ ΕΛΛΑΔΟΣ",  # 1 I MACHI TIS ELLADOS
#     "Η ΜΑΧΗ ΤΗΣ ΚΟΝΙΤΣΑΣ": "ΜΑΧΗ ΤΗΣ ΚΟΝΙΤΣΑΣ",  # 1 I MACHI TIS KONITSAS
#     "Η ΜΑΧΗ ΤΗΣ ΚΡΗΤΗΣ": "ΜΑΧΗ ΤΗΣ ΚΡΗΤΗΣ",  # 1 I MACHI TIS KRITIS
#     "Η ΜΑΧΗ ΤΗΣ ΧΑΙΡΩΝΑΣ": "ΜΑΧΗ ΤΗΣ ΧΑΙΡΩΝΑΣ",  # 1 I MACHI TIS CHAIRONAS
#     "Η ΜΑΧΗ ΤΟΥ ΠΕΤΑ": "ΜΑΧΗ ΤΟΥ ΠΕΤΑ",  # 1 I MACHI TOU PETA
#     "Η ΜΑΧΗ ΤΟΥ ΣΕΛΤΣΟΥ": "ΜΑΧΗ ΤΟΥ ΣΕΛΤΣΟΥ",  # 1 I MACHI TOU SELTSOU
#     "Η ΜΑΧΗ ΤΩΝ ΑΘΗΝΩΝ": "ΜΑΧΗ ΤΩΝ ΑΘΗΝΩΝ",  # 1 I MACHI TON ATHINON
#     "Η ΠΟΙΗΣΗ ΣΤΗ ΖΩΗ ΜΑΣ": "ΠΟΙΗΣΗ ΣΤΗ ΖΩΗ ΜΑΣ",  # 1 I POIISI STI ZOI MAS
#     "Η.Π.": "Η.Π.Α.",  # 1 I.P.
#     "Η.Π.Α.": "Η.Π.Α.",  # 1 I.P.A.
#     "Η.Π.Α": "Η.Π.Α.",  # 2 I.P.A
#     "ΗΕΝΗ ΛΟΓΟΤΕΧΝΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 IENI LOGOTECHNIA
#     "ΗΕΩΜΕΤΡΙΑ": "ΓΕΩΜΕΤΡΙΑ",  # 1 IEOMETRIA
#     "ΗΘΟΓΡΑΦΙΑ": "ΗΘΟΓΡΑΦΙΕΣ",  # 2 ITHOGRAFIA
#     "ΗΘΟΠΟΙΟΙ": "ΗΘΟΠΟΙΟΣ",  # 1 ITHOPOIOI
#     "ΗΛΙΑΔΑ": "ΙΛΙΑΔΑ",  # 1 ILIADA
#     "ΗΜΕΡΑ ΦΙΛΛΕΛΗΝΙΣΜΟΥ": "ΗΜΕΡΑ ΦΙΛΕΛΛΗΝΙΣΜΟΥ",  # 1 IMERA FILLELINISMOU
#     "ΗΜΕΡΙΔΑ                                          Η": "ΗΜΕΡΙΔΕΣ",  # 1 IMERIDA                                          I
#     "ΗΜΕΡΙΔΑ": "ΗΜΕΡΙΔΕΣ",  # 25 IMERIDA
#     "ΗΜΕΡΙΔΕΣ": "ΗΜΕΡΙΔΕΣ",  # 1 IMERIDES
#     "ΗΜΕΡΟΛΟΓΙΟ ΑΛΕΞΑΝΔΡΟΥ ΜΑΥΡΟΚΠΡΔΑΤΟΥ": "ΗΜΕΡΟΛΟΓΙΟ ΑΛΕΞΑΝΔΡΟΥ ΜΑΥΡΟΚΟΡΔΑΤΟΥ",  # 1 IMEROLOGIO ALEXANDROU MAVROKPRDATOU
#     "ΗΜΕΡΟΛΟΓΙΟ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΗΜΕΡΟΛΟΓΙΟ",  # 1 IMEROLOGIO ELLINIKI LOGOTECHNIA
#     "ΗΜΕΡΟΛΟΓΙΟ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΗΜΕΡΟΛΟΓΙΟ",  # 1 IMEROLOGIO ELLINIKI LOGOTCHNIA
#     "ΗΠΕΙΡΟ": "ΗΠΕΙΡΟΣ",  # 1 IPEIRO
#     "ΗΠΙΤΗΣ": "",  # 1 IPITIS
#     "ΗΡΩΔΗΣ ΑΤΤΙΚΟΣ": "ΗΡΩΔΗΣ ΑΤΤΙΚΟΣ",  # 1 IRODIS ATTIKOS
#     "ΗΡΩΔΗΣ Ο ΑΤΤΙΚΟΣ": "ΗΡΩΔΗΣ ΑΤΤΙΚΟΣ",  # 1 IRODIS O ATTIKOS
#     "ΗΡΩΔΗΣ Ο ΜΕΓΑΣ": "ΗΡΩΔΗΣ ΜΕΓΑΣ",  # 1 IRODIS O MEGAS
#     "ΘΕΑΡΤΙΚΟ ΕΡΓΟ": "ΘΕΑΤΡΙΚΑ ΕΡΓΑ",  # 1 THEARTIKO ERGO
#     "ΘΕΑΤΡΙ ΣΚΙΩΝ": "ΘΕΑΤΡΟ ΣΚΙΩΝ",  # 1 THEATRI SKION
#     "ΘΕΑΤΡΙΙΚΟ ΕΡΓΟ": "ΘΕΑΤΡΙΚΑ ΕΡΓΑ",  # 1 THEATRIIKO ERGO
#     "ΘΕΑΤΡΙΚΟ ΕΡΓΟ": "ΘΕΑΤΡΙΚΑ ΕΡΓΑ",  # 184 THEATRIKO ERGO
#     "ΘΕΑΤΡΙΚΟ": "ΘΕΑΤΡΙΚΑ ΕΡΓΑ",  # 8 THEATRIKO
#     "ΘΕΑΤΡΙΟ ΣΚΙΩΝ": "ΘΕΑΤΡΟ ΣΚΙΩΝ",  # 1 THEATRIO SKION
#     "ΘΕΗΣΚΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 2 THEISKEIA
#     "ΘΕΙΑ ΛΕΟΙΤΟΥΡΓΙΑ": "ΘΕΙΑ ΛΕΙΤΟΥΡΓΙΑ",  # 1 THEIA LEOITOURGIA
#     "ΘΕΡΑΠΕΙΑ ΚΑΡΑΚΙΝΟΥ": "ΘΕΡΑΠΕΙΑ ΚΑΡΚΙΝΟΥ",  # 1 THERAPEIA KARAKINOU
#     "ΘΕΣ/ΝΙΚΗ": "ΘΕΣΣΑΛΟΝΙΚΗ",  # 2 THES/NIKI
#     "ΘΕΤΡΙΚΟ ΕΡΓΟ": "ΘΕΑΤΡΙΚΑ ΕΡΓΑ",  # 2 THETRIKO ERGO
#     "ΘΕΤΡΟ": "ΘΕΑΤΡΟ",  # 1 THETRO
#     "ΘΕΩΡΙΑ ΤΗΣ ΑΦΗΓΗΣΗΣ": "ΘΕΩΡΙΑ ΑΦΗΓΗΣΗΣ",  # 1 THEORIA TIS AFIGISIS
#     "ΘΕΩΡΙΑ ΤΗΣ ΕΞΕΛΙΞΗΣ": "ΘΕΩΡΙΑ ΕΞΕΛΙΞΗΣ",  # 1 THEORIA TIS EXELIXIS
#     "ΘΕΩΡΙΑ ΤΗΣ ΜΟΥΣΙΚΗΣ": "ΘΕΩΡΙΑ ΜΟΥΣΙΚΗΣ",  # 1 THEORIA TIS MOUSIKIS
#     "ΘΕΩΡΙΑ ΤΗΣ ΣΧΕΤΙΚΟΤΗΤΑΣ": "ΘΕΩΡΙΑ ΣΧΕΤΙΚΟΤΗΤΑΣ",  # 1 THEORIA TIS SCHETIKOTITAS
#     "ΘΕΩΡΙΑ ΤΟΥ STAMMLER": "ΘΕΩΡΙΑ STAMMLER",  # 1 THEORIA TOU STAMMLER
#     "ΘΕΩΡΙΑ ΤΩΝ ΑΡΙΘΜΩΝ": "ΘΕΩΡΙΑ ΑΡΙΘΜΩΝ",  # 1 THEORIA TON ARITHMON
#     "ΘΟΘΚΥΔΙΔΗΣ": "ΘΟΥΚΥΔΙΔΗΣ",  # 1 THOTHKYDIDIS
#     "ΘΟΥΚΙΔΙΔΗ": "ΘΟΥΚΥΔΙΔΗΣ",  # 1 THOUKIDIDI
#     "ΘΡΗΑΚΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 1 THRIAKEIA
#     "ΘΡΗΚΣΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 3 THRIKSEIA
#     "ΘΡΗΣΕΚΙΑ ΒΑΤΙΚΑΝΟ": "ΘΡΗΣΚΕΙΑ ΒΑΤΙΚΑΝΟ",  # 1 THRISEKIA VATIKANO
#     "ΘΡΗΣΕΚΙΑ": "ΘΡΗΣΚΕΙΑ",  # 4 THRISEKIA
#     "ΘΡΗΣΚΕΙ": "ΘΡΗΣΚΕΙΑ",  # 3 THRISKEI
#     "ΘΡΗΣΛΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 1 THRISLEIA
#     "ΘΡΣΗΕΚΙΑ": "ΘΡΗΣΚΕΙΑ",  # 2 THRSIEKIA
#     "ΘΡΣΗΚΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 2 THRSIKEIA
#     "ΘΡΣΚΕΙΑ": "ΘΡΗΣΚΕΙΑ",  # 1 THRSKEIA
#     "ΙΑΤΡΟΙ": "ΓΙΑΤΡΟΙ",  # 2 IATROI
#     "ΙΑΤΡΟΣ": "ΓΙΑΤΡΟΙ",  # 1 IATROS
#     "ΙΓΑΝΑΤΙΟΣ": "ΙΓΝΑΤΙΟΣ",  # 1 IGANATIOS
#     "ΙΟ71Μ.Χ": "1071 Μ.Χ",  # 1 IO71M.CH
#     "ΙΟΥΔΑΣ 0 ΙΣΚΑΡΙΩΤΗΣ": "ΙΟΥΔΑΣ ΙΣΚΑΡΙΩΤΗΣ",  # 1 IOUDAS 0 ISKARIOTIS
#     "ΙΟΥΛΙΟΣ ΓΑΙΟΣ ΚΑΙΣΑΡ": "ΙΟΥΛΙΟΣ ΚΑΙΣΑΡΑΣ",  # 1 IOULIOS GAIOS KAISAR
#     "ΙΟΥΣΤΙΑΝΟΣ": "ΙΟΥΣΤΙΝΙΑΝΟΣ",  # 1 IOUSTIANOS
#     "ΙΣΠΑΝΙΚΗ ΛΟΓΟΕΧΝΙΑ": "ΙΣΠΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ISPANIKI LOGOECHNIA
#     "ΙΣΡΑΛΙΝΗ ΣΤΟΡΙΑ": "ΙΣΡΑΗΛΙΝΗ ΙΣΤΟΡΙΑ",  # 1 ISRALINI STORIA
#     "ΙΣΡΟΡΙΑ": "ΙΣΤΟΡΙΑ",  # 1 ISRORIA
#     "ΙΣΤΙΡΙΑ": "ΙΣΤΟΡΙΑ",  # 2 ISTIRIA
#     "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑ ΑΘΗΝΑ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΑΘΗΝΑΣ",  # 1 ISTORIA ARCHAIA ATHINA
#     "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑ ΕΛΛΑΔΑ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ",  # 1 ISTORIA ARCHAIA ELLADA
#     "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΕΛΛΑΔΟΣ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ",  # 1 ISTORIA ARCHAIAS ELLADOS
#     "ΙΣΤΟΡΙΑ ΑΡΧΑΙΩΝ ΑΘΗΝΩΝ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΑΘΗΝΑΣ",  # 1 ISTORIA ARCHAION ATHINON
#     "ΙΣΤΟΡΙΑ ΒΕΛΙΖΕΛΟΣ": "ΙΣΤΟΡΙΑ ΒΕΝΙΖΕΛΟΣ",  # 1 ISTORIA VELIZELOS
#     "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΗΣ ΕΠΑΝΑΣΤΑΣΕΩΣ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΗΣ ΕΠΑΝΑΣΤΑΣΗΣ",  # 2 ISTORIA ELLINIKIS EPANASTASEOS
#     "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΣΜΟΣ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΟΥ ΕΘΝΟΥΣ",  # 1 ISTORIA ELLINISMOS
#     "ΙΣΤΟΡΙΑ ΕΛΛΗΝΩΝ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΟΥ ΕΘΝΟΥΣ",  # 1 ISTORIA ELLINON
#     "ΙΣΤΟΡΙΑ ΙΣΤΟΡΙΑ ΙΣΤΟΡΙΑ": "ΙΣΤΟΡΙΑ",  # 1 ISTORIA ISTORIA ISTORIA
#     "ΙΣΤΟΡΙΑ ΛΟΓΟΤΕΧΝΙΑ": "ΙΣΤΟΡΙΑ ΛΟΓΟΤΕΧΝΙΑΣ",  # 2 ISTORIA LOGOTECHNIA
#     "ΙΣΤΟΡΙΑ ΜΑΚΕΔΟΝΙΑ": "ΙΣΤΟΡΙΑ ΜΑΚΕΔΟΝΙΑΣ",  # 1 ISTORIA MAKEDONIA
#     "ΙΣΤΟΡΙΑ ΜΙΚΡΑ ΑΣΙΑ": "ΙΣΤΟΡΙΑ ΜΙΚΡΑΣ ΑΣΙΑΣ",  # 1 ISTORIA MIKRA ASIA
#     "ΙΣΤΟΡΙΑ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑ": "ΙΣΤΟΡΙΑ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ",  # 1 ISTORIA NEOELLINIKIS LOGOTECHNIA
#     "ΙΣΤΟΡΙΑ ΠΑΠΝΔΡΕΟΥ": "ΙΣΤΟΡΙΑ ΠΑΠΑΝΔΡΕΟΥ",  # 1 ISTORIA PAPNDREOU
#     "ΙΣΤΟΡΙΑ ΠΟΛΙΤΙΣΜΟΣ": "ΙΣΤΟΡΙΑ ΠΟΛΙΤΙΣΜΟΥ",  # 1 ISTORIA POLITISMOS
#     "ΙΣΤΟΡΙΑ ΠΟΛΙΤΙΣΜΩΝ": "ΙΣΤΟΡΙΑ ΠΟΛΙΤΙΣΜΟΥ",  # 1 ISTORIA POLITISMON
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ",  # 2 ISTORIA TIS ARCHAIAS ELLADAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΑΡΧΑΙΑΣ ΕΛΛΑΔΟΣ": "ΙΣΤΟΡΙΑ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ",  # 1 ISTORIA TIS ARCHAIAS ELLADOS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΕΚΠΑΙΔΕΥΣΗΣ": "ΙΣΤΟΡΙΑ ΕΚΠΑΙΔΕΥΣΗΣ",  # 1 ISTORIA TIS EKPAIDEFSIS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΕΛΛΗΝΙΚΗΣ ΕΠΑΝΑΣΤΑΣΕΩΣ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΗΣ ΕΠΑΝΑΣΤΑΣΗΣ",  # 1 ISTORIA TIS ELLINIKIS EPANASTASEOS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ",  # 1 ISTORIA TIS ELLINIKIS LOGOTECHNIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΛΟΓΟΤΕΧΝΙΑΣ": "ΙΣΤΟΡΙΑ ΛΟΓΟΤΕΧΝΙΑΣ",  # 1 ISTORIA TIS LOGOTECHNIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΜΑΚΕΔΟΝΙΑ": "ΙΣΤΟΡΙΑ ΜΑΚΕΔΟΝΙΑΣ",  # 1 ISTORIA TIS MAKEDONIA
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΜΑΚΕΔΟΝΙΑΣ": "ΙΣΤΟΡΙΑ ΜΑΚΕΔΟΝΙΑΣ",  # 12 ISTORIA TIS MAKEDONIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΜΑΝΗΣ": "ΙΣΤΟΡΙΑ ΜΑΝΗΣ",  # 1 ISTORIA TIS MANIS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΜΙΚΡΑΣ ΑΣΙΑΣ": "ΙΣΤΟΡΙΑ ΜΙΚΡΑΣ ΑΣΙΑΣ",  # 1 ISTORIA TIS MIKRAS ASIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑ": "ΙΣΤΟΡΙΑ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ",  # 1 ISTORIA TIS NEOELLINIKIS LOGOTECHNIA
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ": "ΙΣΤΟΡΙΑ ΝΕΟΕΛΛΗΝΙΚΗΣ ΛΟΓΟΤΕΧΝΙΑΣ",  # 1 ISTORIA TIS NEOELLINIKIS LOGOTECHNIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΟΙΚΟΝΟΜΙΑ": "ΙΣΤΟΡΙΑ ΟΙΚΟΝΟΜΙΑΣ",  # 1 ISTORIA TIS OIKONOMIA
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΠΛΗΡΟΦΟΡΙΑΣ": "ΙΣΤΟΡΙΑ ΠΛΗΡΟΦΟΡΙΑΣ",  # 1 ISTORIA TIS PLIROFORIAS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΤΕΧΝΗΣ": "ΙΣΤΟΡΙΑ ΤΕΧΝΗΣ",  # 3 ISTORIA TIS TECHNIS
#     "ΙΣΤΟΡΙΑ ΤΗΣ ΦΙΛΟΣΟΦΙΑΣ": "ΙΣΤΟΡΙΑ ΦΙΛΟΣΟΦΙΑΣ",  # 3 ISTORIA TIS FILOSOFIAS
#     "ΙΣΤΟΡΙΑ ΤΟΥ ΕΛΛΗΝΙΚΟΥ ΕΘΝΟΥΣ": "ΙΣΤΟΡΙΑ ΕΛΛΗΝΙΚΟΥ ΕΘΝΟΥΣ",  # 2 ISTORIA TOU ELLINIKOU ETHNOUS
#     "ΙΣΤΟΡΙΑ ΤΟΥ ΠΟΛΙΤΙΣΜΟΥ": "ΙΣΤΟΡΙΑ ΠΟΛΙΤΙΣΜΟΥ",  # 1 ISTORIA TOU POLITISMOU
#     "ΙΣΤΟΡΙΑ ΤΟΥ ΤΥΠΟΥ": "ΙΣΤΟΡΙΑ ΤΥΠΟΥ",  # 1 ISTORIA TOU TYPOU
#     "ΙΣΤΟΡΙΑ ΤΩΝ ΜΕΓΑΛΩΝ": "ΙΣΤΟΡΙΑ ΜΕΓΑΛΩΝ",  # 1 ISTORIA TON MEGALON
#     "ΙΣΤΟΡΙΑ": "",  # 1071 ISTORIA
#     "ΙΣΤΟΡΙΑ0ΓΑΛΛΙΚΗ ΕΠΑΝΑΣΤΑΣΗ": "ΙΣΤΟΡΙΑ ΓΑΛΛΙΚΗΣ ΕΠΑΝΑΣΤΑΣΗΣ",  # 1 ISTORIA0GALLIKI EPANASTASI
#     "ΙΣΤΟΡΙΑΙ": "ΙΣΤΟΡΙΑ",  # 1 ISTORIAI
#     "ΙΣΤΟΡΙΚΟ ΜΥΘΙΣΤΟΡΗΜ": "ΙΣΤΟΡΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 ISTORIKO MYTHISTORIM
#     "ΙΣΤΟΡΙΚΟ ΜΥΘΙΤΟΡΗΜΑ": "ΙΣΤΟΡΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 ISTORIKO MYTHITORIMA
#     "ΙΣΤΟΡΙΚΟ ΜΥΘΙΤΣΟΡΗΜΑ": "ΙΣΤΟΡΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 ISTORIKO MYTHITSORIMA
#     "ΙΣΤΟΤΙΑ": "ΙΣΤΟΡΙΑ",  # 1 ISTOTIA
#     "ΙΤΑΛΙKΑ": "ΙΤΑΛΙΚΑ",  # 1 ITALIKA
#     "ΙΤΑΛΙΟΑ": "ΙΤΑΛΙΑ",  # 1 ITALIOA
#     "ΙΤΑΛΟ": "ΙΤΑΛΙΚΟ",  # 2 ITALO
#     "ΙΩΑΚΕΙΜ Γ'": "ΙΩΑΚΕΙΜ Γ",  # 1 IOAKEIM G'
#     "ΙΩΝΝΙΝΑ": "ΙΩΑΝΝΙΝΑ",  # 1 IONNINA
#     "Κ.Κ.Ε": "Κ.Κ.Ε.",  # 1 K.K.E
#     "ΚΑΒΑΦΗΣ,Κ.Π": "ΚΑΒΑΦΗΣ",  # 1 KAVAFIS,K.P
#     "ΚΑΙΡΟ.ΑΙΓΥΠΤΙΑΚΟ ΜΟΥΣΕΙΟ": "ΚΑΙΡΟ ΑΙΓΥΠΤΙΑΚΟ ΜΟΥΣΕΙΟ",  # 1 KAIRO.AIGYPTIAKO MOUSEIO
#     "ΚΑΙΣΑΡ ΓΑΙΟΣ ΙΟΥΛΙΟΣ": "ΚΑΙΣΑΡΑΣ ΓΑΙΟΣ ΙΟΥΛΙΟΣ",  # 1 KAISAR GAIOS IOULIOS
#     "ΚΑΙΣΑΡ": "ΚΑΙΣΑΡΑΣ",  # 5 KAISAR
#     "ΚΑΙΣΑΡΑΣ ΙΟΥΛΙΟΣ": "ΚΑΙΣΑΡΑΣ ΓΑΙΟΣ ΙΟΥΛΙΟΣ",  # 1 KAISARAS IOULIOS
#     "ΚΑΛΛΕΚΤΙΒΙΣΜΟΣ": "ΚΟΛΛΕΚΤΙΒΙΣΜΟΣ",  # 1 KALLEKTIVISMOS
#     "ΚΑΡΑΙΣΚΑΚΗ": "ΚΑΡΑΙΣΚΑΚΗΣ",  # 1 KARAISKAKI
#     "ΚΑΡΥΣΤΟ": "ΚΑΡΥΣΤΟΣ",  # 2 KARYSTO
#     "ΚΑΡΧΗΔΟΝΙΟΙ ΠΟΛΕΜΟΙ": "ΚΑΡΧΗΔΟΝΙΑΚΟΣ ΠΟΛΕΜΟΣ",  # 1 KARCHIDONIOI POLEMOI
#     "ΚΑΡΧΙΔΙΝΙΟΙ": "ΚΑΡΧΗΔΟΝΙΟΙ",  # 1 KARCHIDINIOI
#     "ΚΑΡΧΙΔΟΝΑ": "ΚΑΡΧΗΔΟΝΑ",  # 1 KARCHIDONA
#     "ΚΑΡΧΙΔΟΝΙΑΚΟΣ ΠΟΛΕΜΟΣ": "ΚΑΡΧΗΔΟΝΙΑΚΟΣ ΠΟΛΕΜΟΣ",  # 1 KARCHIDONIAKOS POLEMOS
#     "ΚΑΡΧΙΔΟΝΙΑΚΟΣ": "ΚΑΡΧΗΔΟΝΙΑΚΟΣ",  # 1 KARCHIDONIAKOS
#     "ΚΑΡΧΙΔΟΝΙΚΟΣ ΠΟΛΕΜΟΣ": "ΚΑΡΧΗΔΟΝΙΑΚΟΣ ΠΟΛΕΜΟΣ",  # 1 KARCHIDONIKOS POLEMOS
#     "ΚΑΡΧΙΔΟΝΙΟΙ": "ΚΑΡΧΗΔΟΝΙΟΙ",  # 1 KARCHIDONIOI
#     "ΚΑΡΧΙΔΩΝΑ": "ΚΑΡΧΗΔΟΝΑ",  # 2 KARCHIDONA
#     "ΚΑΣΤΡΟ": "ΚΑΣΤΡΑ",  # 2 KASTRO
#     "ΚΑΤΑΣΤΡΟΦΗ": "ΚΑΤΑΣΤΡΟΦΕΣ",  # 2 KATASTROFI
#     "ΚΑΤΑΦΡΑΦΗ ΔΡΑΣΤΗΡΙΟΤΗΤΩΝ": "ΚΑΤΑΓΡΑΦΗ ΔΡΑΣΤΗΡΙΟΤΗΤΩΝ",  # 1 KATAFRAFI DRASTIRIOTITON
#     "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΝΙΑ": "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 KINEZIKI LOGOTENIA
#     "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 13 KINEZIKI LOGOTECHNIA
#     "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΚΙΝΕΖΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 KINEZIKI LOGOTCHNIA
#     "ΚΙΝΗΜΑΤΟΓΡΑΑΦΟΣ": "ΚΙΝΗΜΑΤΟΓΡΑΦΟΣ",  # 1 KINIMATOGRAAFOS
#     "ΚΙΝΗΜΗ": "ΚΙΝΗΣΗ",  # 1 KINIMI
#     "ΚΙΝΩΝΙΑ": "ΚΟΙΝΩΝΙΑ",  # 1 KINONIA
#     "ΚΚΕ ΕΣ": "Κ.Κ.Ε. ΕΣΩΤΕΡΙΚΟΥ",  # 1 KKE ES
#     "ΚΚΕ ΕΣΩΤΕΡΙΚΟΥ": "Κ.Κ.Ε. ΕΣΩΤΕΡΙΚΟΥ",  # 1 KKE ESOTERIKOU
#     "ΚΚΕ": "Κ.Κ.Ε.",  # 2 KKE
#     "ΚΛΑΣΣΙΚΗ ΑΡΧΑΙΟΤΗΤΑ": "ΚΛΑΣΙΚΗ ΑΡΧΑΙΟΤΗΤΑ",  # 1 KLASSIKI ARCHAIOTITA
#     "ΚΛΑΣΣΙΚΗ ΕΛΛΑΔΑ": "ΚΛΑΣΙΚΗ ΕΛΛΑΔΑ",  # 1 KLASSIKI ELLADA
#     "ΚΛΑΣΣΙΚΗ ΕΠΙΣΤΗΜΗ": "ΚΛΑΣΙΚΗ ΕΠΙΣΤΗΜΗ",  # 1 KLASSIKI EPISTIMI
#     "ΚΛΑΣΣΙΚΗ ΕΠΟΧΗ": "ΚΛΑΣΙΚΗ ΕΠΟΧΗ",  # 1 KLASSIKI EPOCHI
#     "ΚΛΑΣΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΚΛΑΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 2 KLASSIKI LOGOTECHNIA
#     "ΚΛΑΣΣΙΚΗ ΜΟΥΣΙΚΗ": "ΚΛΑΣΙΚΗ ΜΟΥΣΙΚΗ",  # 1 KLASSIKI MOUSIKI
#     "ΚΛΑΣΣΙΚΗ ΦΙΛΟΛΟΓΙΑ": "ΚΛΑΣΙΚΗ ΦΙΛΟΛΟΓΙΑ",  # 1 KLASSIKI FILOLOGIA
#     "ΚΛΑΣΣΙΚΗ": "ΚΛΑΣΙΚΗ",  # 2 KLASSIKI
#     "ΚΛΑΣΣΙΚΟΙ ΧΡΟΝΟΙ": "ΚΛΑΣΙΚΟΙ ΧΡΟΝΟΙ",  # 3 KLASSIKOI CHRONOI
#     "ΚΟΙΝΟΝΙΟΛΟΓΙΑ": "ΚΟΙΝΩΝΙΟΛΟΓΙΑ",  # 2 KOINONIOLOGIA
#     "ΚΟΙΝΟΤΗΤΑ": "ΚΟΙΝΟΤΗΤΕΣ",  # 2 KOINOTITA
#     "ΚΟΙΝΩΝΙΚΑ ΠΡΟΩΛΗΜΑΤΑ": "ΚΟΙΝΩΝΙΚΑ ΠΡΟΒΛΗΜΑΤΑ",  # 1 KOINONIKA PROOLIMATA
#     "ΚΟΙΝΩΝΙΚΗ ΚΙΑ ΠΝΕΥΜΑΤΙΚΗ ΖΩΗ": "ΚΟΙΝΩΝΙΚΗ ΚΑΙ ΠΝΕΥΜΑΤΙΚΗ ΖΩΗ",  # 1 KOINONIKI KIA PNEVMATIKI ZOI
#     "ΚΟΙΝΩΝΙΚΗ ΠΡΟΝΕΙΑ": "ΚΟΙΝΩΝΙΚΗ ΠΡΟΝΟΙΑ",  # 1 KOINONIKI PRONEIA
#     "ΚΟΙΝΩΝΝΙΟΛΟΓΙΑ": "ΚΟΙΝΩΝΙΟΛΟΓΙΑ",  # 1 KOINONNIOLOGIA
#     "ΚΟΛΛΕΒΙΣΤΙΚΗ ΕΠΙΣΤΗΜΗ": "ΚΟΛΛΕΚΤΙΒΙΣΤΙΚΗ ΕΠΙΣΤΗΜΗ",  # 1 KOLLEVISTIKI EPISTIMI
#     "ΚΟΛΛΕΒΙΣΤΙΚΗ": "ΚΟΛΛΕΚΤΙΒΙΣΤΙΚΗ",  # 1 KOLLEVISTIKI
#     "ΚΟΛΛΕΚΤΙΒΙΣΤΙΚΑ": "ΚΟΛΛΕΚΤΙΒΙΣΤΙΚΑ ΣΥΣΤΗΜΑΤΑ",  # 2 KOLLEKTIVISTIKA
#     "ΚΟΛΟΚΟΤΡΩΝΗ": "ΚΟΛΟΚΟΤΡΩΝΗΣ",  # 1 KOLOKOTRONI
#     "ΚΟΜΙΚ": "ΚΟΜΙΚΣ",  # 1 KOMIK
#     "ΚΟΜΙΞ": "ΚΟΜΙΚΣ",  # 1 KOMIX
#     "ΚΟΜΜΟΝΙΣΜΟΣ": "ΚΟΜΜΟΥΝΙΣΜΟΣ",  # 1 KOMMONISMOS
#     "ΚΟΡΕTIKA": "ΚΟΡΕΑΤΙΚΑ",  # 1 KORETIKA
#     "ΚΟΡΕΑTIKA": "ΚΟΡΕΑΤΙΚΑ",  # 1 KOREATIKA
#     "ΚΟΣΜΑΣ Ο ΑΙΤΩΛΟΣ": "ΚΟΣΜΑΣ ΑΙΤΩΛΟΣ",  # 5 KOSMAS O AITOLOS
#     "ΚΟΣΜΑΣ ΣΙΤΩΛΟΣ": "ΚΟΣΜΑΣ ΑΙΤΩΛΟΣ",  # 1 KOSMAS SITOLOS
#     "ΚΟΥΜΜΟΥΝΙΣΜΟΣ": "ΚΟΜΜΟΥΝΙΣΜΟΣ",  # 1 KOUMMOUNISMOS
#     "ΚΟΥΜΟΥΝΙΣΜΟΣ": "ΚΟΜΜΟΥΝΙΣΜΟΣ",  # 2 KOUMOUNISMOS
#     "ΚΟΥΦΑΙΟΙ ΕΛΛΗΝΕΣ ΠΕΖΟΓΡΑΦΟΙ": "ΚΟΡΥΦΑΙΟΙ ΕΛΛΗΝΕΣ ΠΕΖΟΓΡΑΦΟΙ",  # 1 KOUFAIOI ELLINES PEZOGRAFOI
#     "ΚΡΙΤΙΚΑ ΜΕΛΕΤΗΜΑ": "ΚΡΙΤΙΚΑ ΜΕΛΕΤΗΜΑΤΑ",  # 1 KRITIKA MELETIMA
#     "ΚΤΗΝΙΑΤΡΟΥΣ": "ΚΤΗΝΙΑΤΡΟΙ",  # 1 KTINIATROUS
#     "ΚΥΒΕΡΝΗΣΗ": "ΚΥΒΕΡΝΗΣΕΙΣ",  # 1 KYVERNISI
#     "ΚΥΒΕΡΝΗΤΗΣ ΤΗΣ ΕΛΛΑΔΟΣ": "ΚΥΒΕΡΝΗΤΕΣ ΤΗΣ ΕΛΛΑΔΟΣ",  # 1 KYVERNITIS TIS ELLADOS
#     "ΚΥΒΕΡΝΗΤΗΣ": "ΚΥΒΕΡΝΗΤΕΣ",  # 2 KYVERNITIS
#     "ΚΥΠΡΟ": "ΚΥΠΡΟΣ",  # 1 KYPRO
#     "ΚΥΡΙΑΚΑΤΙΚΗ ΠΡΟΣΕΥΧΗ": "",  # 1 KYRIAKATIKI PROSEFCHI
#     "ΚΥΡΙΑΚΗΣ ΠΡΟΣΕΥΧΗ": "ΚΥΡΙΑΚΑΤΙΚΗ ΠΡΟΣΕΥΧΗ",  # 1 KYRIAKIS PROSEFCHI
#     "ΚΩΔΙΞ": "ΚΩΔΙΚΑΣ",  # 1 KODIX
#     "ΚΩΝ/ΝΟΣ ΚΑΡΑΜΑΝΛΗΣ": "ΚΩΝΣΤΑΝΤΙΝΟΣ ΚΑΡΑΜΑΝΛΗΣ",  # 1 KON/NOS KARAMANLIS
#     "ΚΩΝΣΤΑΝΤΙΚΟΣ": "ΚΩΝΣΤΑΝΤΙΝΟΣ",  # 1 KONSTANTIKOS
#     "ΚΩΝΣΤΑΝΤΙΝΟΣ Α'": "ΚΩΝΣΤΑΝΤΙΝΟΣ Α",  # 1 KONSTANTINOS A'
#     "ΚΩΝΣΤΑΝΤΙΝΟΣ Γ'": "ΚΩΝΣΤΑΝΤΙΝΟΣ Γ",  # 1 KONSTANTINOS G'
#     "ΚΩΝΣΤΑΝΤΙΝΟΣ Δ'": "ΚΩΝΣΤΑΝΤΙΝΟΣ Δ",  # 1 KONSTANTINOS D'
#     "ΛΑΚΕΔΑΟΜΟΝΙΑ": "ΛΑΚΕΔΑΙΜΟΝΙΑ",  # 1 LAKEDAOMONIA
#     "ΛΑΟΓΑΡΦΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 2 LAOGARFIA
#     "ΛΑΟΓΡΑΦΘΑ": "ΛΑΟΓΡΑΦΙΑ",  # 1 LAOGRAFTHA
#     "ΛΑΟΓΡΑΦΙΚΑ ΤΗΣ ΑΡΤΑΣ": "ΛΑΟΓΡΑΦΙΚΑ ΑΡΤΑΣ",  # 1 LAOGRAFIKA TIS ARTAS
#     "ΛΑΟΓΡΑΦΙΚΑ": "ΛΑΟΓΡΑΦΙΑ",  # 4 LAOGRAFIKA
#     "ΛΑΟΓΡΦΑΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 2 LAOGRFAIA
#     "ΛΑΟΓΡΦΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 1 LAOGRFIA
#     "ΛΑΟΡΑΦΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 1 LAORAFIA
#     "ΛΑΤΙΝΩΚΩΝ ΕΠΙΣΤΗΜΩΝ": "ΛΑΤΙΝΙΚΩΝ ΕΠΙΣΤΗΜΩΝ",  # 1 LATINOKON EPISTIMON
#     "ΛΓΟΤΕΧΝΙΑ": "ΛΟΓΟΤΕΧΝΙΑ",  # 1 LGOTECHNIA
#     "ΛΕΖΒΟΣ": "ΛΕΣΒΟΣ",  # 1 LEZVOS
#     "ΛΕΞ8ΙΚΟΝ": "ΛΕΞΙΚΟ",  # 1 LEX8IKON
#     "ΛΕΞΙΚΟΝ": "ΛΕΞΙΚΟ",  # 2 LEXIKON
#     "ΛΕΟΝΑΡΔΟΣ ΝΡΑ ΒΙΝΤΣΙ": "ΛΕΟΝΑΡΔΟΣ ΝΤΑ ΒΙΝΤΣΙ",  # 1 LEONARDOS NRA VINTSI
#     "ΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 LINIKI POIISI
#     "ΛΙΝΚΟΛΝ": "ΛΙΝΚΟΛΝ ΑΒΡΑΑΜ",  # 2 LINKOLN
#     "ΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 LLINIKI LOGOTECHNIA
#     "ΛΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 LLINIKI POIISI
#     "ΛΟΑΓΡΑΦΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 1 LOAGRAFIA
#     "ΛΟΓΟΤΕΝΙΑ": "ΛΟΓΟΤΕΧΝΙΑ",  # 1 LOGOTENIA
#     "ΛΟΓΟΤΕΝΧΙΑ": "ΛΟΓΟΤΕΧΝΙΑ",  # 1 LOGOTENCHIA
#     "ΛΟΓΟΤΕΧΝΙΑ ΕΛΛΗΝΙΚΗ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 4 LOGOTECHNIA ELLINIKI
#     "ΛΟΓΟΤΕΧΝΙΑ ΚΛΑΣΣΙΚΗ": "ΛΟΓΟΤΕΧΝΙΑ ΚΛΑΣΙΚΗ",  # 3 LOGOTECHNIA KLASSIKI
#     "ΛΟΓΡΑΦΙΑ": "ΛΑΟΓΡΑΦΙΑ",  # 1 LOGRAFIA
#     "ΛΟΓΤΕΧΝΙΑ": "ΛΟΓΟΤΕΧΝΙΑ",  # 1 LOGTECHNIA
#     "ΛΟΝΔΙΝΟ.ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ": "ΛΟΝΔΙΝΟ ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ",  # 1 LONDINO.ETHNIKI PINAKOTHIKI
#     "ΛΟΥΔΟΒΙΚΟΣ ΙΔ'": "ΛΟΥΔΟΒΙΚΟΣ ΙΔ",  # 1 LOUDOVIKOS ID'
#     "Μ,ΑΣΙΑ": "ΜΙΚΡΑ ΑΣΙΑ",  # 1 M,ASIA
#     "Μ. ΑΛΕΞΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 M. ALEXANDROS
#     "Μ.ΑΛΕΞΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 2 M.ALEXANDROS
#     "Μ.ΑΣΙΑ": "ΜΙΚΡΑ ΑΣΙΑ",  # 3 M.ASIA
#     "ΜΑΑΣΤΡΙΧ": "ΜΑΑΣΤΡΙΧΤ",  # 1 MAASTRICH
#     "ΜΑΔΡΙΤΗ.ΜΟΥΣΕΙΟ ΠΡΑΔΟ": "ΜΑΔΡΙΤΗ ΜΟΥΣΕΙΟ ΠΡΑΔΟ",  # 1 MADRITI.MOUSEIO PRADO
#     "ΜΑΚΕΔΟΝΙΚΟ ΖΗΤΗΜΜΑ": "ΜΑΚΕΔΟΝΙΚΟ ΖΗΤΗΜΑ",  # 1 MAKEDONIKO ZITIMMA
#     "ΜΑΚΙΑΒΕΛΗΣ": "ΜΑΚΙΑΒΕΛΙ",  # 1 MAKIAVELIS
#     "ΜΑΚΙΑΒΕΛΛΗΣ": "ΜΑΚΙΑΒΕΛΙ",  # 1 MAKIAVELLIS
#     "ΜΑΞΙΜΟΣ ΓΑΡΙΚΟΣ": "ΜΑΞΙΜΟΣ ΓΡΑΙΚΟΣ",  # 1 MAXIMOS GARIKOS
#     "ΜΑΞΙΜΟΣ Ε'": "ΜΑΞΙΜΟΣ Ε",  # 1 MAXIMOS E'
#     "ΜΑΡΣΑΛΛ": "ΜΑΡΣΑΛ",  # 1 MARSALL
#     "ΜΑΧΗ ΤΗΣ ΕΛΛΑΔΟΣ": "ΜΑΧΗ ΕΛΛΑΔΟΣ",  # 1 MACHI TIS ELLADOS
#     "ΜΑΧΗ ΤΗΣ ΚΟΝΙΤΣΑΣ": "ΜΑΧΗ ΚΟΝΙΤΣΑΣ",  # 1 MACHI TIS KONITSAS
#     "ΜΑΧΗ ΤΗΣ ΚΡΗΤΗΣ": "ΜΑΧΗ ΚΡΗΤΗΣ",  # 2 MACHI TIS KRITIS
#     "ΜΑΧΗ ΤΗΣ ΧΑΙΡΩΝΑΣ": "ΜΑΧΗ ΧΑΙΡΩΝΑΣ",  # 1 MACHI TIS CHAIRONAS
#     "ΜΑΧΗ ΤΟΥ ΜΑΡΑΘΩΝΑ": "ΜΑΧΗ ΜΑΡΑΘΩΝΑ",  # 1 MACHI TOU MARATHONA
#     "ΜΑΧΗ ΤΟΥ ΠΕΤΑ": "ΜΑΧΗ ΠΕΤΑ",  # 1 MACHI TOU PETA
#     "ΜΑΧΗ ΤΟΥ ΣΕΛΤΣΟΥ": "ΜΑΧΗ ΣΕΛΤΣΟΥ",  # 1 MACHI TOU SELTSOU
#     "ΜΑΧΗ ΤΩΝ ΑΘΗΝΩΝ": "ΜΑΧΗ ΑΘΗΝΩΝ",  # 1 MACHI TON ATHINON
#     "ΜΕΓΑΛΑ ΜΟΥΣΕΙΑ.ΑΜΣΤΕΡΝΤΑΜ": "ΜΕΓΑΛΑ ΜΟΥΣΕΙΑ ΑΜΣΤΕΡΝΤΑΜ",  # 1 MEGALA MOUSEIA.AMSTERNTAM
#     "ΜΕΓΑΛΑ ΜΟΥΣΕΙΑ.ΤΟΡΙΝΟ": "ΜΕΓΑΛΑ ΜΟΥΣΕΙΑ ΤΟΡΙΝΟ",  # 1 MEGALA MOUSEIA.TORINO
#     "ΜΕΓΑΛΟΣ ΑΛΕΞΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 MEGALOS ALEXANDROS
#     "ΜΕΓΑΛΟΥ ΑΛΕΞΑΝΔΡΟΥ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 MEGALOU ALEXANDROU
#     "ΜΕΓΑΣ ΑΛΕΚΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 MEGAS ALEKANDROS
#     "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 99 MEGAS ALEXANDROS
#     "ΜΕΓΑΣ ΑΛΕΞΑΝΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 MEGAS ALEXANROS
#     "ΜΕΓΑΣ ΚΩΣΤΑΝΤΙΝΟΣ": "ΜΕΓΑΣ ΚΩΝΣΤΑΝΤΙΝΟΣ",  # 1 MEGAS KOSTANTINOS
#     "ΜΕΚΑΔΟΝΙΑ": "ΜΑΚΕΔΟΝΙΑ",  # 1 MEKADONIA
#     "ΜΕΚΑΛΟΙ ΑΥΤΟΚΡΑΤΟΡΕΣ": "ΜΕΓΑΛΟΙ ΑΥΤΟΚΡΑΤΟΡΕΣ",  # 1 MEKALOI AFTOKRATORES
#     "ΜΕΛΕΤΕ": "ΜΕΛΕΤΕΣ",  # 1 MELETE
#     "ΜΕΛΕΤΗ]": "ΜΕΛΕΤΗ",  # 1 MELETI]
#     "ΜΕΛΕΤΗΜΑ": "ΜΕΛΕΤΗΜΑΤΑ",  # 1 MELETIMA
#     "ΜΕΣΗ ΑΝΑΤΟΛΗ:ΔΙΕΘΝΕΙΣ ΣΧΕΣΕΙΣ": "ΜΕΣΗ ΑΝΑΤΟΛΗ ΔΙΕΘΝΕΙΣ ΣΧΕΣΕΙΣ",  # 1 MESI ANATOLI:DIETHNEIS SCHESEIS
#     "ΜΕΣΟΓΕΙΟ": "ΜΕΣΟΓΕΙΟΣ",  # 1 MESOGEIO
#     "ΜΕΣΣΟΛΟΓΓΙ": "ΜΕΣΟΛΟΓΓΙ",  # 1 MESSOLONGI
#     "ΜΕΤΑΞΑ": "ΜΕΤΑΞΑΣ",  # 1 METAXA
#     "ΜΕΤΑΠΟΛΕΜΙΚΟΣ  ΚΟΣΜΟΣ": "ΜΕΤΑΠΟΛΕΜΙΚΟΣ ΚΟΣΜΟΣ",  # 1 METAPOLEMIKOS  KOSMOS
#     "ΜΕΤΑΠΟΛΙΤΕΣΥΗ": "ΜΕΤΑΠΟΛΙΤΕΥΣΗ",  # 1 METAPOLITESYI
#     "ΜΕΤΑΦΟΡΑΙ": "ΜΕΤΑΦΟΡΕΣ",  # 1 METAFORAI
#     "ΜΕΤΞΑ": "ΜΕΤΑΞΑΣ",  # 1 METXA
#     "ΜΗΔΙΚΟΣ ΠΟΛΕΜΟΣ": "ΜΗΔΙΚΟΙ ΠΟΛΕΜΟΙ",  # 1 MIDIKOS POLEMOS
#     "ΜΗΔΙΚΟΣ": "ΜΗΔΙΚΟΙ",  # 2 MIDIKOS
#     "ΜΙΚΡΑ ΑΣΙΑ                                       Σ": "ΜΙΚΡΑ ΑΣΙΑ",  # 1 MIKRA ASIA                                       S
#     "ΜΙΚΡΑΣΙΑ": "ΜΙΚΡΑ ΑΣΙΑ",  # 1 MIKRASIA
#     "ΜΙΚΡΑΣΙΑΤΙΚΑ ΘΡΑΚΙΑΚ ΚΕΝΤΗΜΑΤΑ": "ΜΙΚΡΑΣΙΑΤΙΚΑ ΘΡΑΚΙΚΑ ΚΕΝΤΗΜΑΤΑ",  # 1 MIKRASIATIKA THRAKIAK KENTIMATA
#     "ΜΚΕΔΟΝΙΑ": "ΜΑΚΕΔΟΝΙΑ",  # 1 MKEDONIA
#     "ΜΝΗΜΕΙ": "ΜΝΗΜΕΙΑ",  # 1 MNIMEI
#     "ΜΝΗΜΝΕΙΑ": "ΜΝΗΜΕΙΑ",  # 1 MNIMNEIA
#     "ΜΟΚΡΑΣΙΑΤΙΚΗ ΚΑΤΑΣΤΡΟΦΗ": "ΜΙΚΡΑΣΙΑΤΙΚΗ ΚΑΤΑΣΤΡΟΦΗ",  # 1 MOKRASIATIKI KATASTROFI
#     "ΜΟΝΑΧΟ.ΠΑΛΑΙΑ ΠΙΝΑΚΟΘΗΚΗ": "ΜΟΝΑΧΟ ΠΑΛΑΙΑ ΠΙΝΑΚΟΘΗΚΗ",  # 1 MONACHO.PALAIA PINAKOTHIKI
#     "ΜΟΡΦΕΣ ΙΣΤΟΡΙΑ": "ΜΟΡΦΕΣ ΙΣΤΟΡΙΑΣ",  # 1 MORFES ISTORIA
#     "ΜΟΡΦΕΣ ΤΗΣ ΙΣΤΟΡΙΑΣ": "ΜΟΡΦΕΣ ΙΣΤΟΡΙΑΣ",  # 1 MORFES TIS ISTORIAS
#     "ΜΟΣΧΑ.ΜΟΥΣΕΙΟ ΠΟΥΣΚΙΝ": "ΜΟΣΧΑ ΜΟΥΣΕΙΟ ΠΟΥΣΚΙΝ",  # 1 MOSCHA.MOUSEIO POUSKIN
#     "ΜΟΣΧΟΠΟΛΗΣ": "ΜΟΣΧΟΠΟΛΗ",  # 1 MOSCHOPOLIS
#     "ΜΟΣΧΟΠΟΛΙΣ": "ΜΟΣΧΟΠΟΛΗ",  # 2 MOSCHOPOLIS
#     "ΜΟΥΣΕΙ ΘΗΒΑΣ": "ΜΟΥΣΕΙΟ ΘΗΒΑΣ",  # 1 MOUSEI THIVAS
#     "ΜΟΥΣΕΙΟ": "ΜΟΥΣΕΙΑ",  # 8 MOUSEIO
#     "ΜΟΥΣΕΟ": "ΜΟΥΣΕΙΑ",  # 1 MOUSEO
#     "ΜΟΥΣΟΛΙΝΗ": "ΜΟΥΣΟΛΙΝΙ",  # 1 MOUSOLINI
#     "ΜΟΥΣΟΥΛΜΑΝΟΥΣ": "ΜΟΥΣΟΥΛΜΑΝΟΙ",  # 1 MOUSOULMANOUS
#     "ΜΠΕΣΤ ΣΕΛΛΕΡ": "BEST SELLER",
#     "ΜΠΟΛΟΝΙΑ.ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ": "ΜΠΟΛΟΝΙΑ ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ",
#     "ΜΥΘΙΣΤΙΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 2 MYTHISTIRIMA
#     "ΜΥΘΙΣΤΟΗΡΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 2 MYTHISTOIRMA
#     "ΜΥΘΙΣΤΟΡΗΜ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 2 MYTHISTORIM
#     "ΜΥΘΙΣΤΟΡΗΜA": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMA
#     "ΜΥΘΙΣΤΟΡΗΜΑ ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΑΓΓΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMA ANGLIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 13 MYTHISTORIMA ELLINIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑ ΙΣΤΟΡΙΚΟ": "ΙΣΤΟΡΙΚΟ ΜΥΘΙΣΤΟΡΗΜΑ",  # 3 MYTHISTORIMA ISTORIKO
#     "ΜΥΘΙΣΤΟΡΗΜΑ ΙΤΑΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΙΤΑΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMA ITALIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑ ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMA ROSIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑ,ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 3 MYTHISTORIMA,ELLINIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑΤΑ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMATA ELLINIKI LOGOTECHNIA
#     "ΜΥΘΙΣΤΟΡΗΜΑΤΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 66 MYTHISTORIMATA
#     "ΜΥΘΙΣΤΟΡΗΜΑΤΙΚΗ ΒΙΟΓΡΑΦΙΑ": "ΜΥΘΙΣΤΟΡΗΜΑΤΙΚΕΣ ΒΙΟΓΡΑΦΙΕΣ",  # 11 MYTHISTORIMATIKI VIOGRAFIA
#     "ΜΥΘΙΣΤΟΡΗΜΣ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORIMS
#     "ΜΥΘΙΣΤΟΡΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTORMA
#     "ΜΥΘΙΣΤΟΤΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHISTOTRIMA
#     "ΜΥΘΙΤΣΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 2 MYTHITSORIMA
#     "ΜΥΘΟΙΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYTHOISTORIMA
#     "ΜΥΘΟΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 8 MYTHOSTORIMA
#     "ΜΥΘΣΙΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 4 MYTHSITORIMA
#     "ΜΥΘΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 3 MYTHSTORIMA
#     "ΜΥΘΥΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 2 MYTHYSTORIMA
#     "ΜΥΙΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYISTORIMA
#     "ΜΥΥΘΙΣΤΟΡΗΜΑ": "ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 MYYTHISTORIMA
#     "ΝΑΠΟΛΗ.ΕΘΝΙΚΟ ΜΟΥΣΕΙΟ ΚΑΠΟΝΤΙΜΟΝΤΕ": "ΝΑΠΟΛΗ ΕΘΝΙΚΟ ΜΟΥΣΕΙΟ ΚΑΠΟΝΤΙΜΟΝΤΕ",  # 1 NAPOLI.ETHNIKO MOUSEIO KAPONTIMONTE
#     "ΝΕΛΕΤΗ": "ΜΕΛΕΤΗ",  # 1 NELETI
#     "ΝΕΟΕΛΛΗΝΙΚΑ ΚΕΙΜΕΜΕΝΑ": "ΝΕΟΕΛΛΗΝΙΚΑ ΚΕΙΜΕΝΑ",  # 1 NEOELLINIKA KEIMEMENA
#     "ΝΕΟΕΛΛΗΝΙΚΗ ΑΝΕΓΕΝΝΗΣΗ": "ΝΕΟΕΛΛΗΝΙΚΗ ΑΝΑΓΕΝΝΗΣΗ",  # 1 NEOELLINIKI ANEGENNISI
#     "ΝΕΟΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΕΙΑ": "ΝΕΟΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 NEOELLINIKI LOGOTECHNEIA
#     "ΝΕΟΛΑΙΑ0ΚΟΙΝΩΝΙΚΑ ΠΡΟΒΛΗΜΑΤΑ": "ΝΕΟΛΑΙΑ ΚΟΙΝΩΝΙΚΑ ΠΡΟΒΛΗΜΑΤΑ",  # 1 NEOLAIA0KOINONIKA PROVLIMATA
#     "ΝΕΟΛΛΗΝΙΚΑ ΔΙΗΓΗΜΑΤΑ": "ΝΕΟΕΛΛΗΝΙΚΑ ΔΙΗΓΗΜΑΤΑ",  # 1 NEOLLINIKA DIIGIMATA
#     "ΝΟΜΟΣ ΑΙΤ/ΝΙΑΣ": "ΝΟΜΟΣ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",  # 1 NOMOS AIT/NIAS
#     "ΝΟΡΒΗΓΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΝΟΡΒΗΓΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 5 NORVIGIKI LOGOTECHNIA
#     "ΝΟΣΟ ΔΥΤΩΝ": "ΝΟΣΟΣ ΔΥΤΩΝ",  # 1 NOSO DYTON
#     "ΝΟΥΒΑΛΑ": "ΝΟΥΒΕΛΕΣ",  # 1 NOUVALA
#     "ΝΟΥΒΕΛΑ ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ ΝΟΥΒΕΛΕΣ",  # 2 NOUVELA ELLINIKI LOGOTECHNIA
#     "ΝΟΥΒΕΛΑ": "ΝΟΥΒΕΛΕΣ",  # 34 NOUVELA
#     "ΝΟΥΒΕΛΕΣ": "ΝΟΥΒΕΛΕΣ",  # 3 NOUVELES
#     "ΝΟΥΒΕΛΛΑ": "ΝΟΥΒΕΛΕΣ",  # 5 NOUVELLA
#     "ΝΟΥΒΕΛΛΕΣ": "ΝΟΥΒΕΛΕΣ",  # 3 NOUVELLES
#     "ΝΤΟΚΟΥΜΕΝΑ ΒΙΑΣ": "ΝΤΟΚΟΥΜΕΝΤΑ ΒΙΑΣ",  # 1 NTOKOUMENA VIAS
#     "ΞΕΝΗ ΛΟΓΟΕΤΧΝΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 5 XENI LOGOETCHNIA
#     "ΞΕΝΗ ΛΟΓΟΤΕΝΧΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 XENI LOGOTENCHIA
#     "ΞΕΝΗ ΛΟΓΟΤΕΧΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 XENI LOGOTECHIA
#     "ΞΕΝΗ ΛΟΓΟΤΕΧΝΕΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 XENI LOGOTECHNEIA
#     "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 505 XENI LOGOTECHNIA
#     "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑΜΥΘΙΣΤΟΡΗΜΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ ΜΥΘΙΣΤΟΡΗΜΑ",  # 1 XENI LOGOTECHNIAMYTHISTORIMA
#     "ΞΕΝΗ ΛΟΓΟΤΕΧΝΠΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 XENI LOGOTECHNPA
#     "ΞΕΝΗ ΛΟΓΠΤΕΧΝΙΑ": "ΞΕΝΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 XENI LOGPTECHNIA
#     "ΞΕΝΙΤΕΙΑ": "ΞΕΝΙΤΙΑ",  # 1 XENITEIA
#     "ΞΕΝΟΓΛΩΣΟΟ": "ΞΕΝΟΓΛΩΣΣΟ",  # 2 XENOGLOSOO
#     "ΞΕΝΟΓΛΩΣΣΑ ΓΕΡΜΑΝΙΚΑ": "ΓΕΡΜΑΝΙΚΑ",  # 1 XENOGLOSSA GERMANIKA
#     "ΞΕΝΟΓΛΩΣΣΩ": "ΞΕΝΟΓΛΩΣΣΟ",  # 7 XENOGLOSSO
#     "ΞΕΝΟΓΛΩΣΩΩ": "ΞΕΝΟΓΛΩΣΣΟ",  # 2 XENOGLOSOO
#     "ΞΕΝΟΦΩΝ": "ΞΕΝΟΦΩΝΤΑΣ",  # 2 XENOFON
#     "ΞΕΝΠΓΛΩΣΣΟ": "ΞΕΝΟΓΛΩΣΣΟ",  # 4 XENPGLOSSO
#     "ΞΕΣΗΚΟΜΩΣ ΤΟΥ ΓΕΝΟΥΣ": "ΞΕΣΗΚΩΜΟΣ ΤΟΥ ΓΕΝΟΥΣ",  # 1 XESIKOMOS TOU GENOUS
#     "Ο ΒΑΣΙΛΕΙΑΣ ΤΗΣ ΗΠΕΙΡΟΥ": "ΒΑΣΙΛΕΙΑΣ ΗΠΕΙΡΟΥ",  # 1 O VASILEIAS TIS IPEIROU
#     "Ο ΔΙΣΚΟΣ ΤΗΣ ΦΑΙΣΤΟΥ": "ΔΙΣΚΟΣ ΦΑΙΣΤΟΥ",  # 1 O DISKOS TIS FAISTOU
#     "Ο ΙΣΤΟΡΙΚΟΣ": "ΙΣΤΟΡΙΚΟΣ",  # 1 O ISTORIKOS
#     "Ο ΚΑΡΑΒΟΓΙΑΝΝΗΣ": "ΚΑΡΑΒΟΓΙΑΝΝΟΣ",  # 1 O KARAVOGIANNIS
#     "Ο ΚΑΡΑΒΟΓΙΑΝΝΟΣ": "ΚΑΡΑΒΟΓΙΑΝΝΟΣ",  # 1 O KARAVOGIANNOS
#     "Ο ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ": "ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 O MEGAS ALEXANDROS
#     "Ο ΣΛΑΒΙΚΟΣ ΚΙΝΔΥΝΟΣ": "ΣΛΑΒΙΚΟΣ ΚΙΝΔΥΝΟΣ",  # 1 O SLAVIKOS KINDYNOS
#     "Ο ΤΡΙΑΚΟΝΤΑΕΤΗΣ ΠΟΛΕΜΟΣ": "ΤΡΙΑΚΟΝΤΑΕΤΗΣ ΠΟΛΕΜΟΣ",  # 1 O TRIAKONTAETIS POLEMOS
#     "Ο ΧΡΥΣΟΣ ΑΙΩΝΑΣ ΤΗΣ ΦΩΤΟΓΡΑΦΙΑΣ": "ΧΡΥΣΟΣ ΑΙΩΝΑΣ ΦΩΤΟΓΡΑΦΙΑΣ",  # 1 O CHRYSOS AIONAS TIS FOTOGRAFIAS
#     "ΟΔΟΙΠΟΡΙΚΑ": "ΟΔΟΙΠΟΡΙΚΟ",  # 1 ODOIPORIKA
#     "ΟΔΥΣΣΕΑ ΕΛΥΤΗ": "ΟΔΥΣΣΕΑΣ ΕΛΥΤΗΣ",  # 1 ODYSSEA ELYTI
#     "ΟΘΩΜΑΝΟΚΡΤΑΙΑ": "ΟΘΩΜΑΝΟΚΡΑΤΙΑ",  # 1 OTHOMANOKRTAIA
#     "ΟΘΩΝΟΣ": "ΟΘΩΝΑΣ",  # 1 OTHONOS
#     "ΟΙ ΑΘΛΙΟΙ": "ΑΘΛΙΟΙ",  # 1 OI ATHLIOI
#     "ΟΙ ΣΥΝΤΡΟΦΟΙ ΤΟΥ": "ΣΥΝΤΡΟΦΟΙ",  # 1 OI SYNTROFOI TOU
#     "ΟΙ ΧΑΛΚΟΓΡΑΦΟΙ": "ΧΑΛΚΟΓΡΑΦΟΙ",  # 1 OI CHALKOGRAFOI
#     "ΟΙΚΙΜΣΟΙ": "ΟΙΚΙΣΜΟΙ",  # 1 OIKIMSOI
#     "ΟΙΚΟΓΕΝΕΙΕΣ": "ΟΙΚΟΓΕΝΕΙΑ",  # 1 OIKOGENEIES
#     "ΟΙΚΟΛΟΓΙΕΑ": "ΟΙΚΟΛΟΓΙΑ",  # 1 OIKOLOGIEA
#     "ΟΙΚΟΜΙΚΕΣ ΕΠΙΣΤΗΜΕΣ": "ΟΙΚΟΝΟΜΙΚΕΣ ΕΠΙΣΤΗΜΕΣ",  # 1 OIKOMIKES EPISTIMES
#     "ΟΙΚΟΜΙΚΗ ΟΡΓΑΝΩΣΗ": "ΟΙΚΟΝΟΜΙΚΗ ΟΡΓΑΝΩΣΗ",  # 1 OIKOMIKI ORGANOSI
#     "ΟΙΚΟΜΟΜΙΚΟΙ": "ΟΙΚΟΝΟΜΙΚΟΙ",  # 1 OIKOMOMIKOI
#     "ΟΙΚΟΝΟΜΙ": "ΟΙΚΟΝΟΜΟΙ",  # 1 OIKONOMI
#     "ΟΙΚΟΝΟΜΙΚΕΣΕΠΙΣΤΗΜΕΣ": "ΟΙΚΟΝΟΜΙΚΕΣ ΕΠΙΣΤΗΜΕΣ",  # 1 OIKONOMIKESEPISTIMES
#     "ΟΙΚΟΝΟΜΙΚΗ ΑΝΑΠΤΥ": "ΟΙΚΟΝΟΜΙΚΗ ΑΝΑΠΤΥΞΗ",  # 1 OIKONOMIKI ANAPTY
#     "ΟΙΚΟΝΟΜΟΣ": "ΟΙΚΟΝΟΜΙΚΟΙ",  # 1 OIKONOMOS
#     "ΟΙΝΟΜΙΚΕΣ ΕΞΕΛΙΞΕΙΣ": "ΟΙΚΟΝΟΜΙΚΕΣ ΕΞΕΛΙΞΕΙΣ",  # 1 OINOMIKES EXELIXEIS
#     "ΟΙΝΟΜΙΚΕΣ ΕΠΙΣΤΗΜΕΣ": "ΟΙΚΟΝΟΜΙΚΕΣ ΕΠΙΣΤΗΜΕΣ",  # 1 OINOMIKES EPISTIMES
#     "ΟΚΤΜΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ": "ΟΚΤΩΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ",  # 1 OKTMVRIANI EPANASTASI
#     "ΟΚΤΩΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ": "ΟΚΤΩΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ",  # 1 OKTOVRIANI EPANASTASI
#     "ΟΚΤΩΜΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ": "ΟΚΤΩΒΡΙΑΝΗ ΕΠΑΝΑΣΤΑΣΗ",  # 2 OKTOMVRIANI EPANASTASI
#     "ΟΚΤΩΜΒΡΙΑΝΗ": "ΟΚΤΩΒΡΙΑΝΗ",  # 1 OKTOMVRIANI
#     "ΟΛΙΤΙΚΗ ΒΙΟΓΡΑΦΙΑ": "ΠΟΛΙΤΙΚΗ ΒΙΟΓΡΑΦΙΑ",  # 1 OLITIKI VIOGRAFIA
#     "ΟΜΙΛΙΑ": "ΟΜΙΛΙΕΣ",  # 7 OMILIA
#     "ΟΜΙΛΙΕΣ,ΠΟΙΗΜΑΤΑ": "ΟΜΙΛΙΕΣ ΠΟΙΗΜΑΤΑ",  # 1 OMILIES,POIIMATA
#     "ΟΝΕ,ΑΝΤΑΓΩΝΙΣΤΙΚΕΣ ΑΛΛΑΓΕΣ": "ΟΝΕ ΑΝΤΑΓΩΝΙΣΤΙΚΕΣ ΑΛΛΑΓΕΣ",  # 1 ONE,ANTAGONISTIKES ALLAGES
#     "ΟΠΛΑΡΧΗΓΟΣ": "ΟΠΛΑΡΧΗΓΟΙ",  # 7 OPLARCHIGOS
#     "ΟΠΛΑΡΧΗΓΟΥ": "ΟΠΛΑΡΧΗΓΟΙ",  # 1 OPLARCHIGOU
#     "ΟΡΑΤΟΡΙΟ": "ΟΡΑΤΟΡΙΟΝ",  # 1 ORATORIO
#     "ΟΡΓΑΝΩΣΗ ΤΗΣ ΟΙΚΟΝΟΜΙΑΣ": "ΟΡΓΑΝΩΣΗ ΟΙΚΟΝΟΜΙΑΣ",  # 1 ORGANOSI TIS OIKONOMIAS
#     "ΟΡΓΑΝΩΤΙΚΗ ΤΗΣ ΟΙΚΟΝΟΜΙΑΣ": "ΟΡΓΑΝΩΣΗ ΟΙΚΟΝΟΜΙΑΣ",  # 1 ORGANOTIKI TIS OIKONOMIAS
#     "ΟΡΓΩΝΩΣΗ": "ΟΡΓΑΝΩΣΗ",  # 1 ORGONOSI
#     "ΟΥΑΣΙΓΚΤΟΝ.ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ": "ΟΥΑΣΙΓΚΤΟΝ ΕΘΝΙΚΗ ΠΙΝΑΚΟΘΗΚΗ",  # 1 OUASIGKTON.ETHNIKI PINAKOTHIKI
#     "ΟΥΓΚΟΥ": "ΒΙΚΤΟΡ ΟΥΓΚΟ",  # 1 OUGKOU
#     "ΟΥΓΚΩ": "ΒΙΚΤΟΡ ΟΥΓΚΟ",  # 1 OUGKO
#     "ΠAIΔIKA BIBΛIA": "ΠΑΙΔΙΚΑ ΒΙΒΛΙΑ",  # 1 PAIDIKA BIBLIA
#     "ΠAIΔIKO BIBΛIO": "ΠΑΙΔΙΚΟ ΒΙΒΛΙΟ",  # 2 PAIDIKO BIBLIO
#     "ΠΑΓΚΟΣΜΙΟ ΘΕΑΡΤΟ": "ΠΑΓΚΟΣΜΙΟ ΘΕΑΤΡΟ",  # 1 PAGKOSMIO THEARTO
#     "ΠΑΓΚΠΣΜΙΑ": "ΠΑΓΚΟΣΜΙΑ",  # 1 PAGKPSMIA
#     "ΠΑΙΔΙΚΗ  ΛΟΓΟΤΕΧΝΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PAIDIKI  LOGOTECHNIA
#     "ΠΑΙΔΙΚΗ ΛΟΓΟΤΑΧΝΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PAIDIKI LOGOTACHNIA
#     "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΝΧΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 3 PAIDIKI LOGOTENCHIA
#     "ΠΑΙΔΙΚΗ ΛΟΟΤΕΧΝΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PAIDIKI LOOTECHNIA
#     "ΠΑΙΔΙΚΗ ΠΟΓΟΤΕΧΝΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PAIDIKI POGOTECHNIA
#     "ΠΑΙΔΙΛΗ ΛΟΓΟΤΕΧΝΙΑ": "ΠΑΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PAIDILI LOGOTECHNIA
#     "ΠΑΝΕΠΙΣΗΜΙΑ": "ΠΑΝΕΠΙΣΤΗΜΙΑ",  # 1 PANEPISIMIA
#     "ΠΑΝΕΠΙΣΤΗΜΙΟ": "ΠΑΝΕΠΙΣΤΗΜΙΑ",  # 2 PANEPISTIMIO
#     "ΠΑΝΗΓΥΡΙΚΟΙ ΛΟΓΟΙ": "ΠΑΝΗΓΥΡΙΚΟΣ ΛΟΓΟΣ",  # 1 PANIGYRIKOI LOGOI
#     "ΠΆΝΗΓΥΡΙΚΟΣ ΛΟΓΟΣ": "ΠΑΝΗΓΥΡΙΚΟΣ ΛΟΓΟΣ",  # 1 PANIGYRIKOS LOGOS
#     "ΠΑΝΗΓΥΡΙΚΟΣ ΛΟΓΟΣ": "ΠΑΝΗΓΥΡΙΚΟΣ ΛΟΓΟΣ",  # 2 PANIGYRIKOS LOGOS
#     "ΠΑΝΣΛΑΙΣΜΟΣ": "ΠΑΝΣΛΑΥΙΣΜΟΣ",  # 1 PANSLAISMOS
#     "ΠΑΠΑΓΟΣ ΑΛΑΞΑΝΔΡΟΣ": "ΠΑΠΑΓΟΣ ΑΛΕΞΑΝΔΡΟΣ",  # 1 PAPAGOS ALAXANDROS
#     "ΠΑΠΑΙΩΝΝΟΥ": "ΠΑΠΑΙΩΑΝΝΟΥ",  # 1 PAPAIONNOU
#     "ΠΑΠΑΝΔΡΕΟΥ Γ": "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΡΓΙΟΣ",  # 1 PAPANDREOU NCH
#     "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΓΡΙΟΣ": "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΡΓΙΟΣ",  # 1 PAPANDREOU GEOGRIOS
#     "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΡΓΙΟΣ": "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΡΓΙΟΣ",  # 4 PAPANDREOU GEORGIOS
#     "ΠΑΠΑΝΡΕΟΥ ΓΕΩΡΓΙΟΣ": "ΠΑΠΑΝΔΡΕΟΥ ΓΕΩΡΓΙΟΣ",  # 2 PAPANREOU GEORGIOS
#     "ΠΑΡΜΑΥΘΙΑ": "ΠΑΡΑΜΥΘΙΑ",  # 2 PARMAFTHIA
#     "ΠΑΤΡΙΩΤΙΚΟΣ ΥΝΜΟΣ": "ΠΑΤΡΙΩΤΙΚΟΣ ΥΜΝΟΣ",  # 1 PATRIOTIKOS YNMOS
#     "ΠΕΖΓΡΑΦΙΚΗ ΤΡΙΛΟΓΙΑ": "ΠΕΖΟΓΡΑΦΙΚΗ ΤΡΙΛΟΓΙΑ",  # 1 PEZGRAFIKI TRILOGIA
#     "ΠΕΖΟΓΑΦΗΜΑ": "ΠΕΖΟΓΡΑΦΗΜΑ",  # 1 PEZOGAFIMA
#     "ΠΕΖΟΓΡΑΦΗΜΑΤΑ": "ΠΕΖΟΓΑΦΗΜΑ",  # 9 PEZOGRAFIMATA
#     "ΠΕΙΒΒΑΛΟΝ": "ΠΕΡΙΒΑΛΛΟΝ",  # 1 PEIVVALON
#     "ΠΕΙΟΔΙΚΟ": "ΠΕΡΙΟΔΙΚΟ",  # 1 PEIODIKO
#     "ΠΕΡΙΑ ΑΤΥΝΟΜΙΑΣ": "ΠΕΡΙ ΑΣΤΥΝΟΜΙΑΣ",  # 1 PERIA ATYNOMIAS
#     "ΠΕΡΙΒΑΛΛ0Ν": "ΠΕΡΙΒΑΛΛΟΝ",  # 1 PERIVALL0N
#     "ΠΕΡΙΒΒΑΛΟΝ": "ΠΕΡΙΒΑΛΛΟΝ",  # 1 PERIVVALON
#     "ΠΕΡΙΟΔΙΚΑ": "ΠΕΡΙΟΔΙΚΟ",  # 7 PERIODIKA
#     "ΠΕΡΙΟΔΙΚΟΝ": "ΠΕΡΙΟΔΙΚΟ",  # 4 PERIODIKON
#     "ΠΛΑΤΩΝΑ": "ΠΛΑΤΩΝ",  # 1 PLATONA
#     "ΠΛΑΤΩΝΑΣ": "ΠΛΑΤΩΝ",  # 8 PLATONAS
#     "ΠΟΗΜΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 7 POIMATA
#     "ΠΟΙΗΑΜΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 2 POIIAMATA
#     "ΠΟΙΗΜΑ": "ΠΟΙΗΜΑΤΑ",  # 2 POIIMA
#     "ΠΟΙΗΜΑΜΑ": "ΠΟΙΗΜΑΤΑ",  # 1 POIIMAMA
#     "ΠΟΙΗΜΑΤ": "ΠΟΙΗΜΑΤΑ",  # 5 POIIMAT
#     "ΠΟΙΗΜΑΤΑ,ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΠΟΙΗΜΑΤΑ ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 POIIMATA,ELLINIKI POIISI
#     "ΠΟΙΗΜΑΤΑ,ΣΧΟΛΙΑ,ΑΡΘΡΑ": "ΠΟΙΗΜΑΤΑ ΣΧΟΛΙΑ ΑΡΘΡΑ",  # 1 POIIMATA,SCHOLIA,ARTHRA
#     "ΠΟΙΗΜΑΤΑΑ": "ΠΟΙΗΜΑΤΑ",  # 2 POIIMATAA
#     "ΠΟΙΗΜΑΤΑΗ": "ΠΟΙΗΜΑΤΑ",  # 1 POIIMATAI
#     "ΠΟΙΗΜΤΑ": "ΠΟΙΗΜΑΤΑ",  # 1 POIIMTA
#     "ΠΟΙΗΜΤΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 1 POIIMTATA
#     "ΠΟΙΗΣ": "ΠΟΙΗΣΗ",  # 1 POIIS
#     "ΠΟΙΗΣΗ ΛΥΡΙΚΟΙ": "ΛΥΡΙΚΗ ΠΟΙΗΣΗ",  # 1 POIISI LYRIKOI
#     "ΠΟΙΗΣΗ": "ΠΟΙΗΣΗ",  # 1229 POIISI
#     "ΠΟΙΛΙΤΙΚΟΣ": "ΠΟΛΙΤΙΚΟΣ",  # 1 POILITIKOS
#     "ΠΟΙΛΙΤΙΣΜΟΣ": "ΠΟΛΙΤΙΣΜΟΣ",  # 1 POILITISMOS
#     "ΠΟΙΜΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 4 POIMATA
#     "ΠΟΙΤΙΚΑ ΒΙΒΛΙΑ": "ΠΟΙΗΤΙΚΑ ΒΙΒΛΙΑ",  # 1 POITIKA VIVLIA
#     "ΠΟΙΤΙΚΑ": "ΠΟΙΗΤΙΚΑ",  # 1 POITIKA
#     "ΠΟΛITIKH": "ΠΟΛΙΤΙΚΗ",  # 1 POLITIKH
#     "ΠΟΛΕΜΟΣ ΤΗΣ ΠΕΝΝΑΣ": "ΠΟΛΕΜΟΣ ΠΕΝΝΑΣ",  # 1 POLEMOS TIS PENNAS
#     "ΠΟΛΕΟΔΟΜΙΑΑ": "ΠΟΛΕΟΔΟΜΙΑ",  # 1 POLEODOMIAA
#     "ΠΟΛΙΟΡΚΙΑ ΤΗΣ ΑΡΤΑΣ": "ΠΟΛΙΟΡΚΙΑ ΑΡΤΑΣ",  # 1 POLIORKIA TIS ARTAS
#     "ΠΟΛΙΟΡΚΙΑ ΤΗΣ ΚΟΡΙΝΘΟΥ": "ΠΟΛΙΟΡΚΙΑ ΚΟΡΙΝΘΟΥ",  # 1 POLIORKIA TIS KORINTHOU
#     "ΠΟΛΙΤΙΚΗ                                         Π": "ΠΟΛΙΤΙΚΗ",  # 1 POLITIKI                                         P
#     "ΠΟΛΙΤΙΚΗ ΠΟΛΙΤΙΚΗ": "ΠΟΛΙΤΙΚΗ",  # 1 POLITIKI POLITIKI
#     "ΠΟΛΙΤΙΚΗΣ": "ΠΟΛΙΤΙΚΗ",  # 1 POLITIKIS
#     "ΠΟΛΙΤΙΣΜΟ": "ΠΟΛΙΤΙΣΜΟΣ",  # 1 POLITISMO
#     "ΠΟΛΙΤΙΣΜΟΣ ΑΡΧΑΙΑ ΕΛΛΑΔΑ": "ΠΟΛΙΤΙΣΜΟΣ ΑΡΧΑΙΑΣ ΕΛΛΑΔΑΣ",  # 1 POLITISMOS ARCHAIA ELLADA
#     "ΠΟΛΤΙΚΗ": "ΠΟΛΙΤΙΚΗ",  # 3 POLTIKI
#     "ΠΟΛΥΝΕΡΙΟ ΤΡΙΚΑΛΩΝ": "ΠΟΛΥΝΕΡΙ ΤΡΙΚΑΛΩΝ",  # 1 POLYNERIO TRIKALON
#     "ΠΟΝΤΙΑΚΗ ΔΙΑΛΕΚΤΟ": "ΠΟΝΤΙΑΚΗ ΔΙΑΛΕΚΤΟΣ",  # 2 PONTIAKI DIALEKTO
#     "ΠΟΝΤΙΑΚΟΣ ΕΛΛΗΝΙΜΣΟΣ": "ΠΟΝΤΙΑΚΟΣ ΕΛΛΗΝΙΣΜΟΣ",  # 1 PONTIAKOS ELLINIMSOS
#     "ΠΟΟΗΜΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 1 POOIMATA
#     "ΠΟΟΙΗΜΑΤΑ": "ΠΟΙΗΜΑΤΑ",  # 1 POOIIMATA
#     "ΠΟΟΙΗΣΗ": "ΠΟΙΗΣΗ",  # 1 POOIISI
#     "ΠΟΡΤΟΓΛΑΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΠΟΡΤΟΓΑΛΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 PORTOGLAIKI LOGOTECHNIA
#     "ΠΡΚΑΤΙΚΑ ΣΥΜΠΟΣΙΟΥ": "ΠΡΑΚΤΙΚΑ ΣΥΜΠΟΣΙΟΥ",  # 1 PRKATIKA SYMPOSIOU
#     "ΠΡΟΣΑΝΑΤΟΛΙΣΜΟΣ ΓΕΩΡΓΙΚΟΣ": "ΓΕΩΡΓΙΚΟΣ ΠΡΟΣΑΝΑΤΟΛΙΣΜΟΣ",  # 1 PROSANATOLISMOS GEORGIKOS
#     "ΠΡΟΣΤΑΣΙΑ ΤΟΥ ΠΕΡΙΒΑΛΛΟΝΤΟΣ": "ΠΡΟΣΤΑΣΙΑ ΠΕΡΙΒΑΛΛΟΝΤΟΣ",  # 1 PROSTASIA TOU PERIVALLONTOS
#     "ΠΡΟΣΩΠΑ=ΑΡΣΑΚΗΣ": "ΠΡΟΣΩΠΑ ΑΡΣΑΚΗΣ",  # 1 PROSOPA=ARSAKIS
#     "ΠΡΟΣΩΠΟΓΡΑΦΙΑ": "ΠΡΟΣΩΠΟΓΡΑΦΙΕΣ",  # 1 PROSOPOGRAFIA
#     "ΠΡΩΣΟΠΑ": "ΠΡΟΣΩΠΑ",  # 4 PROSOPA
#     "ΠΡΩΣΟΠΙΚΟΤΗΤΕΣ": "ΠΡΟΣΩΠΙΚΟΤΗΤΕΣ",  # 1 PROSOPIKOTITES
#     "ΠΥΡΡΟ": "ΠΥΡΡΟΣ",  # 1 PYRRO
#     "ΠΩΜΑΙΚΗ ΙΣΤΟΡΙΑ": "ΡΩΜΑΙΚΗ ΙΣΤΟΡΙΑ",  # 1 POMAIKI ISTORIA
#     "ΡΗΓΑ ΦΕΡΑΙΟ": "ΡΗΓΑΣ ΦΕΡΑΙΟΣ",  # 1 RIGA FERAIO
#     "ΡΗΤΟΡΑΣ": "ΡΗΤΟΡΕΣ",  # 2 RITORAS
#     "ΡΟΙΔΗΣ,ΕΜΜΑΝΟΥΗΛ": "ΕΜΜΑΝΟΥΗΛ ΡΟΙΔΗΣ",  # 1 ROIDIS,EMMANOUIL
#     "ΡΟΜΑΝΖΟ": "ΡΟΜΑΝΤΖΟ",  # 1 ROMANZO
#     "ΡΟΥΜΑΝΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΡΟΥΜΑΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROUMANIKI LOGOTCHNIA
#     "ΡΡΩΜΑΙΟΙ": "ΡΩΜΑΙΟΙ",  # 1 RROMAIOI
#     "ΡΥΠΑΝΣΗ ΠΕΡΙΒΒΑΛΟΝΤΟΣ": "ΡΥΠΑΝΣΗ ΠΕΡΙΒΑΛΛΟΝΤΟΣ",  # 1 RYPANSI PERIVVALONTOS
#     "ΡΩΑΜΑΙΚΗ ΑΥΤΟΚΡΑΤΟΡΙΑ": "ΡΩΜΑΙΚΗ ΑΥΤΟΚΡΑΤΟΡΙΑ",  # 1 ROAMAIKI AFTOKRATORIA
#     "ΡΩΜΑΙΚΗ ΑΥΤΟΚΤΑΤΟΡΙΑ": "ΡΩΜΑΙΚΗ ΑΥΤΟΚΡΑΤΟΡΙΑ",  # 1 ROMAIKI AFTOKTATORIA
#     "ΡΩΜΗ.ΠΙΝΑΚΟΘΗΚΗ ΜΠΟΡΓΚΕΖΕ": "ΡΩΜΗ ΠΙΝΑΚΟΘΗΚΗ ΜΠΟΡΓΚΕΖΕ",  # 1 ROMI.PINAKOTHIKI BORGKEZE
#     "ΡΩΣΙΚΗ ΛΟΓΟΑΤΕΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSIKI LOGOATECHNIA
#     "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSIKI LOGOTECHNA
#     "ΡΩΣΙΚΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSIKIKI LOGOTECHNIA
#     "ΡΩΣΣΙΚΗ ΛΟΓΟΤΕΝΧΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSSIKI LOGOTENCHIA
#     "ΡΩΣΣΙΚΗ ΛΟΓΟΤΕΧΝΑΙ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSSIKI LOGOTECHNAI
#     "ΡΩΣΣΙΚΗ ΛΟΓΟΤΕΧΝΕΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSSIKI LOGOTECHNEIA
#     "ΡΩΣΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 39 ROSSIKI LOGOTECHNIA
#     "ΡΩΣΣΙΚΗ ΛΟΓΟΤΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSSIKI LOGOTCHNIA
#     "ΡΩΣΣΙΚΗΛΟΓΟΤΕΧΝΙΑ": "ΡΩΣΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 ROSSIKILOGOTECHNIA
#     "ΡΩΣΣΙΚΟ ΛΕΞΙΚΟ ΙΑΤΡΙΚΩΝ ΟΡΩΝ": "ΡΩΣΙΚΟ ΛΕΞΙΚΟ ΙΑΤΡΙΚΩΝ ΟΡΩΝ",  # 1 ROSSIKO LEXIKO IATRIKON ORON
#     "Σ0ΥΛΙ": "ΣΟΥΛΙ",  # 1 S0YLI
#     "ΣΑΒΟΥΑΡ ΒΙΒΡΕ": "ΣΑΒΟΥΑΡ ΒΙΒΡ",  # 1 SAVOUAR VIVRE
#     "ΣΑΗΝΕΤΟΛΟΓΙΑ": "ΣΑΗΕΝΤΟΛΟΓΙΑ",  # 1 SAINETOLOGIA
#     "ΣΕΡΑΦΕΙΜ Α' ΞΕΝΟΠΟΥΛΟΣ": "ΣΕΡΑΦΕΙΜ Α ΞΕΝΟΠΟΥΛΟΣ",  # 1 SERAFEIM A' XENOPOULOS
#     "ΣΕΡΑΦΕΙΜ Α'": "ΣΕΡΑΦΕΙΜ Α",  # 1 SERAFEIM A'
#     "ΣΚΗΝΟΘΕΣΙΑ ΚΙΝΗΜΑΤΙΓΡΑΦΟΥ ΤΗΛΕΟΡΑΣΗΣ": "ΣΚΗΝΟΘΕΣΙΑ ΚΙΝΗΜΑΤΟΓΡΑΦΟΥ ΤΗΛΕΟΡΑΣΗΣ",  # 1 SKINOTHESIA KINIMATIGRAFOU TILEORASIS
#     "ΣΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΕΛΛΗΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 SLLINIKI LOGOTECHNIA
#     "ΣΛΛΗΝΙΚΗ ΠΟΙΗΣΗ": "ΕΛΛΗΝΙΚΗ ΠΟΙΗΣΗ",  # 1 SLLINIKI POIISI
#     "ΣΛΟΒΕΝΙΚΗ ΛΟΓ0ΤΕΧΝΙΑ": "ΣΛΟΒΕΝΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 SLOVENIKI LOG0TECHNIA
#     "ΣΟΗΔΙΚΗ ΠΟΙΗΣΗ": "ΣΟΥΗΔΙΚΗ ΠΟΙΗΣΗ",  # 1 SOIDIKI POIISI
#     "ΣΟΣΙΑΛΙΣΜΣΟΣ": "ΣΟΣΙΑΛΙΣΜΟΣ",  # 1 SOSIALISMSOS
#     "ΣΟΣΙΑΛΟΣΜΟΣ": "ΣΟΣΙΑΛΙΣΜΟΣ",  # 1 SOSIALOSMOS
#     "ΣΟΥΙΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΣΟΥΗΔΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 SOUIDIKI LOGOTECHNIA
#     "ΣΠΥΗΔΙΚΗ ΠΟΙΗΣΗ": "ΣΟΥΗΔΙΚΗ ΠΟΙΗΣΗ",  # 1 SPYIDIKI POIISI
#     "ΣΤΕΡΕΑ ΕΛΛΑΣ": "ΣΤΕΡΕΑ ΕΛΛΑΔΑ",  # 1 STEREA ELLAS
#     "ΣΥΓΓΡΑΦΕΑΣ": "ΣΥΓΓΡΑΦΕΙΣ",  # 1 SYNGRAFEAS
#     "ΣΥΓΧΡΩΝΗ ΓΕΩΡΓΙΑ": "ΣΥΓΧΡΟΝΗ ΓΕΩΡΓΙΑ",  # 1 SYNCHRONI GEORGIA
#     "ΣΥΝΘΗΚΗ ΤΟΥ ΑΓΙΟΥ ΣΤΕΦΑΝΟΥ": "ΣΥΝΘΗΚΗ ΑΓΙΟΥ ΣΤΕΦΑΝΟΥ",  # 1 SYNTHIKI TOU AGIOU STEFANOU
#     "ΣΥΝΤΑΞ/ΤΙΚΟ": "ΣΥΝΤΑΞΙΟΔΟΤΙΚΟ",  # 1 SYNTAX/TIKO
#     "ΣΧΕΔΙΟ ΜΑΡΣΑΛΛ": "ΣΧΕΔΙΟ ΜΑΡΣΑΛ",  # 1 SCHEDIO MARSALL
#     "ΣΧΛΙΚΟ ΒΙΒΛΙΟ": "ΣΧΟΛΙΚΟ ΒΙΒΛΙΟ",  # 1 SCHLIKO VIVLIO
#     "ΣΧΟΛΟΙΚΟΣ ΚΗΠΟΣ": "ΣΧΟΛΙΚΟΣ ΚΗΠΟΣ",  # 1 SCHOLOIKOS KIPOS
#     "ΤΑ ΖΑΓΟΡΟΧΩΡΙΑ": "ΖΑΓΟΡΟΧΩΡΙΑ",  # 1 TA ZAGOROCHORIA
#     "ΤΑ ΛΕΥΚΑΔΙΤΙΚΑ": "ΛΕΥΚΑΔΙΤΙΚΑ",  # 1 TA LEFKADITIKA
#     "ΤΑΞΕΙΔΙ": "ΤΑΞΙΔΙΔΙΑ",  # 1 TAXEIDI
#     "ΤΑΞΕΙΔΙΩΤΙΚΗ ΛΟΓΟΤΕΧΝΙΑ": "ΤΑΞΙΔΙΩΤΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 TAXEIDIOTIKI LOGOTECHNIA
#     "ΤΑΞΙΔΙ ΚΕΝΤΡΙΚΗ ΕΥΡΩΠΗ": "ΤΑΞΙΔΙΑ ΚΕΝΤΡΙΚΗ ΕΥΡΩΠΗ",  # 1 TAXIDI KENTRIKI EVROPI
#     "ΤΑΞΙΔΙ": "ΤΑΞΙΔΙΑ",  # 2 TAXIDI
#     "ΤΑΞΙΔΙΔΙΑ": "ΤΑΞΙΔΙΑ",  # 1 TAXIDIDIA
#     "ΤΑΞΙΔΙΩΤΙΚΑ": "ΤΑΞΙΔΙΩΤΙΚΟ",  # 1 TAXIDIOTIKA
#     "ΤΑΞΙΔΙΩΤΙΚΟΣ ΟΔΗΓΟΣ": "ΤΑΞΙΔΙΩΤΙΚΟΙ ΟΔΗΓΟΙ",  # 1 TAXIDIOTIKOS ODIGOS
#     "ΤΕΧΝH": "ΤΕΧΝΗ",  # 1 TECHNH
#     "ΤΕΧΝΕΣ": "ΤΕΧΝΗ",  # 3 TECHNES
#     "ΤΕΧΝΙΚΗ ΤΟΥ ΨΗΦΙΔΩΤΟΥ": "ΤΕΧΝΙΚΗ ΨΗΦΙΔΩΤΟΥ",  # 1 TECHNIKI TOU PSIFIDOTOU
#     "ΤΕΧΝΙΚΗ ΤΩΝ ΦΙΛΜΣ": "ΤΕΧΝΙΚΗ ΦΙΛΜΣ",  # 1 TECHNIKI TON FILMS
#     "ΤΟ ΓΕΦΥΡΙ ΤΗΣ ΑΡΤΑΣ": "ΓΕΦΥΡΙ ΑΡΤΑΣ",  # 3 TO GEFYRI TIS ARTAS
#     "ΤΟ ΕΡΓΟ ΤΟΥ": "",  # 1 TO ERGO TOU
#     "ΤΟ ΘΕΑΤΡΟ ΣΤΗΝ ΠΟΛΗ": "ΘΕΑΤΡΟ ΣΤΗΝ ΠΟΛΗ",  # 1 TO THEATRO STIN POLI
#     "ΤΟ ΠΑΙΔΙ": "ΠΑΙΔΙ",  # 1 TO PAIDI
#     "ΤΟ ΣΠΗΛΑΙΟ ΤΩΝ ΛΙΜΝΩΝ": "ΣΠΗΛΑΙΟ ΛΙΜΝΩΝ",  # 1 TO SPILAIO TON LIMNON
#     "ΤΟ ΦΑΡΜΑΚΕΙΟ ΤΗΣ ΦΥΣΗΣ": "ΦΑΡΜΑΚΕΙΟ ΦΥΣΗΣ",  # 1 TO FARMAKEIO TIS FYSIS
#     "ΤΟ ΧΡΟΝΙΚΟ ΤΩΝ ΤΟΚΚΩΝ": "ΧΡΟΝΙΚΟ ΤΟΚΚΩΝ",  # 1 TO CHRONIKO TON TOKKON
#     "ΤΟΠΩΝΙΜΙΑ": "ΤΟΠΩΝΥΜΙΑ",  # 1 TOPONIMIA
#     "ΤΟΠΩΝΥΜΙΚΑ": "ΤΟΠΩΝΥΜΙΑ",  # 1 TOPONYMIKA
#     "ΤΟΠΩΝΥΜΙΟ": "ΤΟΠΩΝΥΜΙΑ",  # 1 TOPONYMIO
#     "ΤΟΡΙΝΟ.ΜΟΥΣΕΙΟ ΑΙΓ/ΚΩΝ ΑΡΧ/ΤΩΝ": "ΤΟΡΙΝΟ ΜΟΥΣΕΙΟ ΑΙΓΥΠΤΙΑΚΩΝ ΑΡΧΑΙΟΤΗΤΩΝ",  # 1 TORINO.MOUSEIO AIG/KON ARCH/TON
#     "ΤΟΥΡΙΔΤΙΚΟΔ ΟΔΗΓΟΣ": "ΤΟΥΡΙΣΤΙΚΟΣ ΟΔΗΓΟΣ",  # 1 TOURIDTIKOD ODIGOS
#     "ΤΟΥΡΙΣΤΙΚΟΔ ΟΔΗΓΟΣ": "ΤΟΥΡΙΣΤΙΚΟΣ ΟΔΗΓΟΣ",  # 1 TOURISTIKOD ODIGOS
#     "ΤΟΥΡΚΙΚΗ  ΛΟΓΟΤΕΧΝΙΑ": "ΤΟΥΡΚΙΚΗ ΛΟΓΟΤΕΧΝΙΑ",  # 1 TOURKIKI  LOGOTECHNIA
#     "ΤΟΥΡΚΙΣ": "ΤΟΥΡΚΙΑ",  # 2 TOURKIS
#     "ΤΡΑΓΟΥΔΙΑ ΤΗΣ ΓΥΝΑΙΚΑΣ": "ΤΡΑΓΟΥΔΙΑ ΓΥΝΑΙΚΑΣ",  # 1 TRAGOUDIA TIS GYNAIKAS
#     "ΤΡΑΓΟΥΔΙΑ ΤΗΣ ΛΕΥΤΕΡΙΑΣ": "ΤΡΑΓΟΥΔΙΑ ΛΕΥΤΕΡΙΑΣ",  # 1 TRAGOUDIA TIS LEFTERIAS
#     "ΤΡΑΓΟΥΔΙΑ ΤΩΝ ΒΟΥΝΩΝ": "ΤΡΑΓΟΥΔΙΑ ΒΟΥΝΩΝ",  # 1 TRAGOUDIA TON VOUNON
#     "ΤΡΑΓΩΔΙΑΚΥΠΡΟΥ": "ΤΡΑΓΩΔΙΑ ΚΥΠΡΟΥ",  # 1 TRAGODIAKYPROU
#     "ΤΡΑΔΩΔΙΑ": "ΤΡΑΓΩΔΙΑ",  # 1 TRADODIA
#     "ΤΡΟΜΟΚΡΑΡΙΑ": "ΤΡΟΜΟΚΡΑΤΙΑ",  # 1 TROMOKRARIA
#     "ΤΡΟΜΟΚΡΑΤΕΙΑ": "ΤΡΟΜΟΚΡΑΤΙΑ",  # 1 TROMOKRATEIA
#     "ΤΥΡΑΝΙΑ": "ΤΥΡΑΝΝΙΑ",  # 1 TYRANIA
#     "ΤΥΡΑΝΟΙ": "ΤΥΡΑΝΝΟΙ",  # 1 TYRANOI
#     "ΥΠΑΡΞΙΜΟΣ": "ΥΠΑΡΞΙΣΜΟΣ",  # 1 YPARXIMOS
#     "ΦΑΝΤΑΣΤΙΚΟ ΔΡΑΜ": "",  # 1 FANTASTIKO DRAM
#     "ΦΑΡΑΓΓΙΑ ΣΕΡΒΙΩΝ": "ΦΑΡΑΓΓΙ ΣΕΡΒΙΩΝ",  # 1 FARANGIA SERVION
#     "ΦΑΡΑΓΙΑ ΣΕΡΒΙΩΝ": "ΦΑΡΑΓΓΙ ΣΕΡΒΙΩΝ",  # 1 FARAGIA SERVION
#     "ΦΑΡΜΑΚΕΥΤΙΚΕΣ ΣΥΝΑΤΓΕΣ": "ΦΑΡΜΑΚΕΥΤΙΚΕΣ ΣΥΝΤΑΓΕΣ",  # 1 FARMAKEFTIKES SYNATGES
#     "ΦΑΡΜΑΚΟΟΛΟΓΙΑ": "ΦΑΡΜΑΚΟΛΟΓΙΑ",  # 1 FARMAKOOLOGIA
#     "ΦΕΟΥΔΑΡΧΙΣΜΟΣ": "ΦΕΟΥΔΑΡΧΙΑ",  # 1 FEOUDARCHISMOS
#     "ΦΙΛΑΝΔΙΚΑ ΜΑΘΗΜΑΤΑ": "ΦΙΝΛΑΝΔΙΚΑ ΜΑΘΗΜΑΤΑ",  # 1 FILANDIKA MATHIMATA
#     "ΦΙΛΑΡΕΟΣ": "ΦΙΛΑΡΕΤΟΣ",  # 1 FILAREOS
#     "ΦΙΛΕΛΛΗΝΑΣ": "ΦΙΛΕΛΛΗΝΕΣ",  # 1 FILELLINAS
#     "ΦΙΛΙΚΗ ΕΤΙΑΡΕΙΑ": "ΦΙΛΙΚΗ ΕΤΑΙΡΕΙΑ",  # 1 FILIKI ETIAREIA
#     "ΦΙΛΙΠΠΟΣ Β'": "ΦΙΛΙΠΠΟΣ Β",  # 2 FILIPPOS V'
#     "ΦΙΛΙΠΠΟΣ Β": "ΦΙΛΙΠΠΟΣ Β",  # 4 FILIPPOS V
#     "ΦΙΛΙΠΠΟΣ ΙΙ": "ΦΙΛΙΠΠΟΣ Β",  # 2 FILIPPOS II
#     "ΦΙΛΙΠΠΟΥ": "ΦΙΛΙΠΠΟΣ Β",  # 1 FILIPPOU
#     "ΦΙΛΛΕΛΗΝΕΣ": "ΦΙΛΕΛΛΗΝΕΣ",  # 1 FILLELINES
#     "ΦΙΛΛΙΠΟΣ": "ΦΙΛΙΠΠΟΣ",  # 2 FILLIPOS
#     "ΦΙΛΜΣ": "ΦΙΛΜ",  # 2 FILMS
#     "ΦΙΛΟΣΟΣΦΙΑ": "ΦΙΛΟΣΟΦΙΑ",  # 1 FILOSOSFIA
#     "ΦΙΛΟΣΟΦΗΜΑΤΑ": "ΦΙΛΟΣΟΦΙΑ",  # 1 FILOSOFIMATA
#     "ΦΙΛΟΣΟΦΙΑ\\": "ΦΙΛΟΣΟΦΙΑ",  # 1 FILOSOFIA\
#     "ΦΙΛΟΣΟΦΙΚΗ": "ΦΙΛΟΣΟΦΙΑ",  # 1 FILOSOFIKI
#     "ΦΙΛΟΣΟΦΙΚΟ": "ΦΙΛΟΣΟΦΙΑ",  # 1 FILOSOFIKO
#     "ΦΙΛΟΣΟΦΟΣ": "ΦΙΛΟΣΟΦΟΙ",  # 2 FILOSOFOS
#     "ΦΙΣΟΦΙΑ": "ΦΙΛΟΣΟΦΙΑ",  # 1 FISOFIA
#     "ΦΛΩΡΕΝΤΙΑ.ΠΑΛΑΤΣΟ ΠΙΤΙ": "ΦΛΩΡΕΝΤΙΑ ΠΑΛΑΤΣΟ ΠΙΤΙ",  # 1 FLORENTIA.PALATSO PITI
#     "ΦΛΩΡΕΝΤΙΑ.ΠΙΝΑΚΟΘΗΚΗ ΟΥΦΙΤΣΙ": "ΦΛΩΡΕΝΤΙΑ ΠΙΝΑΚΟΘΗΚΗ ΟΥΦΙΤΣΙ",  # 1 FLORENTIA.PINAKOTHIKI OUFITSI
#     "ΦΟΡΕΣΙΑ": "ΦΟΡΕΣΙΕΣ",  # 1 FORESIA
#     "ΦΟΡΟΛΟΓΙΚΟ": "ΦΟΡΟΛΟΓΙΑ",  # 2 FOROLOGIKO
#     "ΦΡΟΝΤΗΣΤΗΡΙΑΚΑ ΒΑΒΛΙΑ": "ΦΡΟΝΤΙΣΤΗΡΙΑΚΑ ΒΙΒΛΙΑ",  # 1 FRONTISTIRIAKA VAVLIA
#     "ΦΡΟΝΤΗΣΤΗΡΙΑΚΑ ΒΙΒΛΙΑ": "ΦΡΟΝΤΙΣΤΗΡΙΑΚΑ ΒΙΒΛΙΑ",  # 6 FRONTISTIRIAKA VIVLIA
#     "ΦΥΛΑΙ ΜΙΚΡΑΣ ΑΣΙΑΣ": "ΦΥΛΕΣ ΜΙΚΡΑΣ ΑΣΙΑΣ",  # 1 FYLAI MIKRAS ASIAS
#     "ΦΥΛΑΙ": "ΦΥΛΕΣ",  # 1 FYLAI
#     "ΦΥΤΟΛΟΓΙΟ": "ΦΥΤΟΛΟΓΙΑ",  # 1 FYTOLOGIO
#     "ΦΩΚΙΣ": "ΦΩΚΙΔΑ",  # 1 FOKIS
#     "ΦΩΤΟΓΡΑΦΙΕΣ": "ΦΩΤΟΓΡΑΦΙΑ",  # 1 FOTOGRAFIES
#     "ΧΑΝΤ ΜΠΩΛ": "ΧΑΝΤ ΜΠΩΛ",
#     "ΧΑΝΤΜΠΟΛ": "ΧΑΝΤ ΜΠΩΛ",
#     "ΧΡΗΜΑ": "ΧΡΗΜΑ",
#     "ΧΡΗΜΑΤΑ": "ΧΡΗΜΑ",
#     "ΧΡΙΣΤΙΑΝΙΚΗ": "ΧΡΙΣΤΙΑΝΙΣΜΟΣ",
#     "ΧΡΟΝΙΚΑ": "ΧΡΟΝΙΚΟ",
#     "ΧΡΟΝΙΚΟ": "ΧΡΟΝΙΚΟ",
#     "ΧΩΡΙΑ": "ΧΩΡΙΑ",
#     "ΧΩΡΙΟ": "ΧΩΡΙΑ",
#     "ΨΥΣΟΛΟΓΙΑ": "ΨΥΧΟΛΟΓΙΑ",  # 1 PSYSOLOGIA
#     "ΨΥΧΙΚΗ ΝΟΣΟ": "ΨΥΧΙΚΗ ΝΟΣΟΣ",  # 1 PSYCHIKI NOSO
#     "ΨΥΧΟΑΓΩΓΗ": "ΨΥΧΑΓΩΓΗ",  # 1 PSYCHOAGOGI
#     "ΨΥΧΟΛΟΓΑ": "ΨΥΧΟΛΟΓΙΑ",  # 1 PSYCHOLOGA
#     "ΨΥΧΟΧΟΓΙΑ": "ΨΥΧΟΛΟΓΙΑ",  # 1 PSYCHOCHOGIA
# }


# def topics_from_a12_to_a15(A12A15):
#     """Cleanup
#     >>> topics_from_a12_to_a15(None)
#     []
#     >>> topics_from_a12_to_a15([])
#     []
#     >>> topics_from_a12_to_a15(['', ''])
#     []
#     >>> topics_from_a12_to_a15(["\\\\"])
#     []
#     >>> topics_from_a12_to_a15(['\\''])
#     []
#     >>> topics_from_a12_to_a15(['A', 'B'])
#     ['A', 'B']
#     >>> topics_from_a12_to_a15(['A-B', 'B'])
#     ['A', 'B']
#     >>> topics_from_a12_to_a15(['19 ΑΙΩΝΑ', 'B'])
#     ['19 ΑΙΩΝΑΣ', 'B']
#     >>> topics_from_a12_to_a15(['foobar-(12-13)'])
#     ['12-13', 'foobar']
#     >>> topics_from_a12_to_a15(['foobar(12-13)'])
#     ['12-13', 'foobar']
#     >>> topics_from_a12_to_a15(['foo bar(12-13)'])
#     ['12-13', 'foo bar']
#     >>> topics_from_a12_to_a15(['foo-bar-(12-13)'])
#     ['12-13', 'foo', 'bar']
#     >>> topics_from_a12_to_a15(['foo bar(1213)'])
#     ['1213', 'foo bar']
#     >>> topics_from_a12_to_a15(['foo bar(1213qw)'])
#     ['1213qw', 'foo bar']
#     >>> topics_from_a12_to_a15(['foobar-(19 ΑΙΩΝΑ)'])
#     ['19 ΑΙΩΝΑΣ', 'foobar']
#     """
#     if not A12A15:
#         return []
#     d = OrderedDict()
#     for line in A12A15:
#         if line:
#             match = topic_in_paren_re.fullmatch(line)
#             if match:
#                 in_parenthesis = match[1].strip()
#                 in_parenthesis = topic_replacements.get(in_parenthesis, in_parenthesis).strip()
#                 d[in_parenthesis] = None
#                 # remove match and parenthesis
#                 line = line.replace(match[1], "").replace("()", "")
#             for topic in line.split("-"):
#                 topic = topic_replacements.get(topic, topic).strip()
#                 if topic:
#                     d[topic] = None
#     return list(d.keys())


# def curator_from_a16(A16):
#     """Cleanup
#     >>> curator_from_a16(None) # None
#     >>> curator_from_a16('') # None
#     >>> curator_from_a16(' ') # None
#     >>> curator_from_a16('woo')
#     'woo'
#     >>> curator_from_a16('ΘΕΣΣΑΛΙΑ') # None
#     >>> curator_from_a16('#') # None
#     """
#     if not A16:
#         return None
#     if A16 in [
#         "ΘΕΣΣΑΛΙΑ",
#         "#",
#         "ΔΩΡΕΑ ΑΚΑΔΗΜΙΑ ΑΘΗΝΩ",
#     ]:
#         return None
#     if not A16.strip():
#         return None
#     return A16.strip()
